{"info":{"author":"Acroname Inc.","author_email":"support@acroname.com","bugtrack_url":null,"classifiers":["License :: Other/Proprietary License","Operating System :: OS Independent","Programming Language :: Python :: 2","Programming Language :: Python :: 3"],"description":"# BrainStem Python Library\n\nThe BrainStem python package gives access to simple python commands\nto control and interact with a collection of BrainStem devices\n\n# Features\n\n- Easily interact with BrainStem devices using python\n- Learn more about the capabilities of BrainStem devices in [Acroname's reference documentation](https://acroname.com/reference/)\n\n# Download\n\n- As of version 2.9.21, the BrainStem Python library is available on [PyPI](https://pypi.org/project/brainstem)\n- It is also available from the BrainStem Development Kit at [Acroname's downloads page](https://acroname.com/software/brainstem-development-kit)\n    - Download the operating system specific BrainStem Development Kit\n    - Once downloaded and contents extracted, inside the extracted folder, navigate to:\n        - `[project_root]/development/python` to find the latest version of the `brainstem-*.whl`\n\n# Installation\n\nOn Windows, to install a new version of BrainStem (or update an existing one), simply execute:\n\n```bash\n$> pip install --user brainstem --upgrade\n```\n\nOr from wheel file:\n\n```bash\n$> pip install --user brainstem-*.whl --upgrade\n```\n\nOn MacOS and Linux, pip is for the older Python 2 version, pip3 must be executed instead:\n```bash\n$ pip3 install --user brainstem --upgrade\n```\n\nOr from wheel file:\n\n```bash\n$ pip3 install --user brainstem-*.whl --upgrade\n```\n\nTo uninstall the library, the easiest way is with pip:\n\nWindows:\n\n```bash\n$> pip uninstall brainstem\n```\n\nMacOS and Linux:\n\n```bash\n$> pip3 uninstall brainstem\n```\n\n# Troubleshooting\n\n- Some additional requirements for installing python wheels in general and the BrainStem wheel specifically may be needed\n- If any errors are encountered installing or running the BrainStem python package, see the `Additional Requirements` section near the bottom of this document\n\n# A Tour of the Python Example\n\nAfter navigating to `[project_root]/development/python_examples`, choose the folder that corresponds with the product being used.  \nFor example, the most common product sold is Acroname's 8-port hub, so the folder needed in this case will be `usbhub3p_example`.\n\nTo run the example, execute:\n\n```bash\n$> python usbhub3p_example.py\n```\n\nfor your specific BrainStem device.  \n\nThe example requires that a USB BrainStem link module be connected to the host computer.  \nIf the following message is seen, there is likely no module connected or the incorrect example program was run:\n\n```\n'Could not find a module.'\n```\n\nOnce the example starts running, it will print out some basic information about\nthe module and then blink the user LED on the module.\n\n# Working with BrainStem from the Interpreter\n\nThe following is a brief introduction to writing a python program that talks to a connected BrainStem:  \n\nStart up the python interpreter:\n\n```bash\n$> python\n```\n\nThe first step is to import the BrainStem package:\n\n```python\n>>>  import brainstem\n```\n\n- `stem` and `discover` are the two primary modules\n- `stem` contains classes for each of the distinct module types:\n\n    * USBStem\n    * EtherStem\n    * MTMIOSerial\n    * MTMPM1\n    * MTMEtherStem\n    * MTMUSBStem\n    * USBHub2x4\n    * MTMRelay\n    * USBHub3p\n    * MTMDAQ1\n    * USBCSwitch\n    * MTMDAQ2\n    * MTMLoad1\n    * USBHub3c\n\nNext search for all connected modules:\n\n```python\n>>> specs = brainstem.discover.findAllModules(brainstem.link.Spec.USB)\n>>> print [str(s) for s in specs]\n```\n\nThen search for the first USB module:\n\n```python\n>>> spec = brainstem.discover.findFirstModule(brainstem.link.Spec.USB)\n>>> print spec\n```\n\nIf a USB module is found, create a USBStem object and connect to it using\nthe spec object that was returned by discover:\n\n```python\n>>> stem = brainstem.stem.USBStem()\n>>> stem.connectFromSpec(spec)\n```\n\nThen get some information about the module:\n\n```python\n>>> result = stem.system.getModel()\n>>> print brainstem.defs.model_info(result.value)\n```\n\nFinally, flash the user LED, on or off every 100ms.\n\n```python\n>>> from time import sleep\n>>> for i in range(0,51):\n...     err = stem.system.setLED(i % 2)\n...     if err != brainstem.result.Result.NO_ERROR:\n...         break\n...     sleep(0.1)\n...\n>>>\n```\n\nThat's it! Once this basic example is running, a good place to go is the\ndocumentation to learn about all the other features available.\n\nAt the prompt type the following:\n\n```python\n>>> help(stem.system)\n# or\n>>> help(brainstem.stem)\n```\n\n***\n\n# Additional Requirements\n\n## python\n\nThe BrainStem python package is currently compatible with python 2.7 and python \n3.6 through 3.10. When using 2.7 it is recommended that your python version be \nat least 2.7.9.\n\nMS Windows generally does not include Python, and a suitable Python package will need to be [downloaded and installed](https://www.python.org/downloads/) before proceeding with the following guide.  \nThe BrainStem wheel is compatible with both 32 and 64bit python packages.  \nPython version >= 2.7.9 is recommended.\n\nMacOS X and most Linux distributions generally include a Python installation.  \nHowever, the installation may not include pip and setuptools which are required to install the BrainStem Python module.\n\n## pip\n\nThe BrainStem python package is installed via a platform specific wheel.  \nTo install these wheels, a relatively up to date version of pip and setuptools is needed.  \nPip can be installed by following the instructions at:  \n\nhttps://pip.pypa.io/en/latest/installing.html\n\nIf pip is installed it may still be helpful to update pip.   \nAdministrator privileges may be required on MacOS and Linux.  \nInstructions for updating pip can be found at:\n\nhttps://pip.pypa.io/en/latest/installing.html#upgrade-pip\n\n\n## libffi\n\nThe BrainStem python library relies on libffi.  \nOn MacOS X and Windows, this is generally available.  \nLinux users may need to install libffi via the distro's package manager.  \nThe package is generally named libffi-dev or similar.\n\n## Python development headers\n\nLinux users may need to install the development package for python\nvia the distro's package manager before the brainstem wheel can be installed.  \nThe package is generally named python-dev or similar.\n\n## CentOS package manager\n\nOn CentOS and yum based distros the following command will install the required packages:\n\n```bash\n$> sudo yum install libffi-devel python-devel\n```\n\n***\n\n# License\n\nLicensed under Proprietary License, see full license text here [full license text here](https://acroname.com/software-license).  \n\n# Support\n\nIf these troubleshooting steps don't solve the issue, please let us know.  \nWe have a mailing list located at: support@acroname.com\nand a [support page](https://acroname.com/contact-us) to get in touch with Acroname support staff.\n\nEnjoy!\n\nThe Acroname Team.\n","description_content_type":"text/markdown","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"http://www.acroname.com","keywords":null,"license":"# Brainstem SDK Software Package License Agreement: PLEASE READ THIS SOFTWARE LICENSE AGREEMENT CAREFULLY BEFORE DOWNLOADING OR USING THE SOFTWARE. BY USING THE SOFTWARE, OR USING EQUIPMENT THAT CONTAINS THE SOFTWARE, YOU ARE CONSENTING TO BE BOUND BY THIS AGREEMENT. IF YOU DO NOT AGREE TO ALL OF THE TERMS OF THIS AGREEMENT, DO NOT USE THE SOFTWARE AND DESTROY ALL COPIES IN YOUR POSSESSION. ## HUBTOOL, STEMTOOL, CONTROLROOM, BRAINSTEM2 LIBRARY SHARED OBJECT, STATIC ARCHIVE, AND LIBRARY HEADERS SOFTWARE LICENSE AGREEMENT Copyright (c) 1994-2024 Acroname Inc. License Grant: Acroname Inc. (\"Acroname\") and its authorized agents grant to customer (\"Customer\") a revocable, nonexclusive, and nontransferable license to use the BrainStem2 shared object (.dylib, .framework, .so, .dll, etc) static archive (.a), and associated library header files (\"Software\") in object code form solely for Customers internal business purposes. Acroname may modify the Software for any reason, without notice and without liability to Customer to comply with applicable law or to otherwise protect Acroname or its affiliates, business partners, licensors, and/or customers from potential legal liability. The Software is licensed to Customer, not sold. Except for the limited license granted above, Acroname and its licensors retain all right, title and interest in the Software and its documentation, including copyrights, patents, trademarks and trade secret rights. Customer agrees that aspects of the Software, including the specific design and structure of individual programs, constitute trade secrets and/or copyrighted material of Acroname. RESTRICTIONS: CUSTOMER SHALL NOT: MODIFY THE SOFTWARE; REVERSE ENGINEER OR REVERSE COMPILE OR REVERSE ASSEMBLE ALL OR ANY PORTION OF THE SOFTWARE, OR OTHERWISE ATTEMPT TO DERIVE THE TRADE SECRETS EMBODIED IN THE SOFTWARE. Customer agrees that redistributions of this Software must retain the above copyright notice, this list of conditions and the following disclaimer. Customer may not copy [or distribute] the Software except to the extent that copying is necessary to use the Software for purposes set forth herein. Customer may not assign, sublicense, rent, timeshare, loan, lease, [or otherwise provide or transfer] the Software, or directly or indirectly permit any third party to use or copy the Software without written permission from Acroname. Limited Warranty; Disclaimer: THE SOFTWARE IS PROVIDED ON AN AS AVAILABLE,AS IS BASIS WITH ALL FAULTS, AND WITHOUT WARRANTY OF ANY KIND. EXCEPT AS SPECIFIED IN THIS AGREEMENT, ALL EXPRESS OR IMPLIED CONDITIONS, REPRESENTATIONS, AND WARRANTIES INCLUDING, WITHOUT LIMITATION, ANY IMPLIED WARRANTY OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, NONINFRINGEMENT OR ARISING FROM A COURSE OF DEALING, USAGE, OR TRADE PRACTICE, WITH RESPECT TO THE SOFTWARE ARE HEREBY EXCLUDED TO THE EXTENT ALLOWED BY APPLICABLE LAW. ACRONAME DOES NOT WARRANT THAT THE SOFTWARE WILL MEET CUSTOMERS REQUIREMENTS, OR THAT THE SOFTWARE IS COMPATIBLE WITH ANY PARTICULAR HARDWARE OR SOFTWARE, OR THAT THE SOFTWARE WILL CONTAIN ANY PARTICULAR FEATURES OR FUNCTIONALITY, OR THAT THE OPERATION OF THE SOFTWARE WILL BE UNINTERRUPTED OR ERROR-FREE, OR THAT DEFECTS IN THE SOFTWARE WILL BE CORRECTED. THIS SOFTWARE IS NOT INTENDED FOR USE IN LIFE SUPPORT SYSTEMS. Acroname shall not be liable for failures caused by third party components and/or third party hardware that is integrated with the Software (including Customers own systems), misuse of the Software, or Customers negligence or willful misconduct. In no event shall Acroname's [or its suppliers'] liability to Customer, whether in contract, tort (including negligence), or otherwise, exceed the price paid by Customer. Some jurisdictions may not allow limitation or exclusion of liability for consequential or incidental damages. Indemnities: Acroname will indemnify, defend, and hold Customer harmless from any claim, demand, action, proceeding, investigation, judgment, loss, damage, fine, liability, cost, or expense, including attorneys fees, experts fees, and court costs, arising out of a claim by a third-party that Customers use of the Software in conformance with the terms of this Agreement infringes a United States patent, copyright, or trade secret of that third party. The foregoing indemnification obligation of Acroname is contingent upon Customers promptly notifying Acroname in writing of such claim, permitting Acroname sole authority to control the defense or settlement of such claim, and providing Acroname reasonable assistance in connection therewith. If a claim of infringement under this Section occurs, or if Acroname determines a claim is likely to occur, Acroname will have the right, in its sole discretion, to either: (i) procure for Customer the right or license to continue to use the Software free of the infringement claim; or (ii) modify the Software to make it non-infringing, without loss of material functionality. If either of these remedies is not reasonably available to Acroname, Acroname may, in its sole discretion, immediately terminate this Agreement. Notwithstanding the foregoing, Acroname shall have no obligation with respect to any claim of infringement that is based upon or arises out of: (i) the use or combination of the Software with any third party hardware, products, data or other materials, including Customers own systems and data; (ii) modification or alteration of the Software by anyone other than Acroname; (iii) Customers use of the Software in excess of the rights granted in this Agreement; (iv) any third party components; (v) specifications provided by Customer, (vi) a business method or process that is inherent to Customers business, or (vii) gross negligence, willful misconduct, or violation of law by Customer (collectively, the Excluded Claims). The provisions of this Section state the sole and exclusive obligations and liability of Acroname and its Acronames suppliers for any claim of intellectual property infringement arising out of or relating to the Software and/or this Agreement and are in lieu of any implied warranties of non-infringement, all of which are expressly disclaimed. Customer will indemnify, defend, and hold Acroname harmless from any claim, demand, action, proceeding, investigation, judgment, loss, damage, fine, liability, cost, or expense, including attorneys fees, experts fees, and court costs, from a third-party claim arising out of an Excluded Claim. Customers indemnification obligation is contingent upon Acroname promptly notifying Customer in writing of such claim, permitting Customer sole authority to control the defense or settlement of such claim, and providing Customer reasonable assistance in connection therewith. Limitation of Liability: TO THE MAXIMUM EXTENT PERMITTED BY LAW, IN NO EVENT SHALL ACRONAME OR ITS SUPPLIERS AND VENDORS BE LIABLE TO CUSTOMER OR ANY THIRD PARTY FOR ANY SPECIAL, INCIDENTAL, CONSEQUENTIAL, PUNITIVE, EXEMPLARY, SPECIAL, OR INDIRECT DAMAGES, WHICH SHALL INCLUDE, WITHOUT LIMITATION, DAMAGES FOR PERSONAL INJURY, LOST PROFITS, LOST DATA AND BUSINESS INTERRUPTION, ARISING OUT OF THE USE OR INABILITY TO USE THE SOFTWARE, EVEN IF ACRONAME HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. IN ANY CASE, THE ENTIRE LIABILITY OF ACRONAME AND ITS SUPPLIERS AND VENDORS UNDER THIS AGREEMENT FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION (WHETHER IN CONTRACT, TORT (INCLUDING NEGLIGENCE), OR OTHERWISE) SHALL BE LIMITED TO THE GREATER OF $500.00 AND FEES PAID BY CUSTOMER, IF ANY, DURING THE TWELVE MONTHS IMMEDIATELY PRECEDING THE FIRST EVENT GIVING RISE TO LIABILITY. Term and Termination: This Agreement is effective until terminated. Customer may terminate this Agreement at any time by destroying all copies of the Software including any documentation. This Agreement will terminate immediately without notice from Acroname if Customer fails to comply with any provision of this Agreement. Upon termination, Customer must destroy all copies of the Software including any documentation. Export: This Software, including technical data, is subject to U.S. export control laws, including the U.S. Export Administration Act and its associated regulations, and may be subject to export or import regulations in other countries. Customer agrees to comply strictly with all such regulations and acknowledges that it has the responsibility to obtain licenses to export, re-export, or import Software. Governing Law: This Agreement shall be governed by and construed in accordance with the laws of the State of Colorado, United States of America, as if performed wholly within the state and without giving effect to the principles of conflict of law. Assignment: Customer may not novate, assign, or transfer in whole or in part any of its rights or obligations under this agreement, whether by operation or law or otherwise, without the prior written consent of Acroname. A change in control of Customer constitutes an assignment of this agreement. Acroname may at any time, by notice to Customer, novate, assign, or transfer in whole or in part its rights and obligations under this agreement to any third party and to the extent necessary, Customer hereby consents to such novation, assignment, or transfer. General: If any portion hereof is found to be void or unenforceable, the remaining provisions of this Agreement shall remain in full force and effect. This Agreement constitutes the entire license between the parties with respect to the use of the Software. ## BRAINSTEM2 DIRECT DEPENDENCY LICENSE NOTIFICATION ### LIB USB This binary distribution uses libUSB (https://libusb.info). LibUSB is licensed under GNU Lesser General Public License (LGPL) v2.1. Acroname will provide, upon request (support@acroname.com), object code sufficient to relink the Acroname provided executables and libraries with an updated interface-compatible libUSB library. Full license text is available: https://www.gnu.org/licenses/lgpl-2.1.html ### QT This binary distribution uses Qt (https://qt.io). Qt is licensed under GNU Lesser General Public License (LGPL) v3.0. Acroname will provide, upon request to support@acroname.com, object code sufficient to relink the Acroname provided executables and libraries with an updated interface compatible Qt library. Full license text for Qt is available: https://www.gnu.org/licenses/lgpl-3.0.en.html ## HUBTOOL ICON CREDITS Settings icons created by Tomas Knop - Flaticon Expand icons created by Google - Flaticon Filter icons created by Kiranshastry - Flaticon Funnel icons created by Freepik - Flaticon ACRONAME EXAMPLES, DOCUMENTATION AND SOURCE CODE DISTRIBUTIONS Copyright (c) 1994-2024, Acroname Inc. All rights reserved. Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met: Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution. THIS SOFTWARE IS NOT INTENDED FOR USE IN LIFE-SUPPORT SYSTEMS. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE. The views and conclusions contained in the software and documentation are those of the authors and should not be interpreted as representing official policies, either expressed or implied, of Acroname Inc. Acroname Inc.","maintainer":null,"maintainer_email":null,"name":"brainstem","package_url":"https://pypi.org/project/brainstem/","platform":null,"project_url":"https://pypi.org/project/brainstem/","project_urls":{"Homepage":"http://www.acroname.com"},"provides_extra":null,"release_url":"https://pypi.org/project/brainstem/2.10.7/","requires_dist":["cffi>=1.0.0"],"requires_python":null,"summary":"Acroname BrainStem Software Control Package","version":"2.10.7","yanked":false,"yanked_reason":null},"last_serial":23101720,"releases":{"0.1.0":[{"comment_text":"","digests":{"blake2b_256":"de6c612eb7ea8f5e717a2215a91ecf7ece5a6b462a9d366a74c2a3a0e60a0117","md5":"a5d8272b37ce52ea185393b459a98617","sha256":"cd7e2d33c111fdb3a9ba436b8264811a0d35888f6a705025dbe4fb808d52e20d"},"downloads":-1,"filename":"brainstem-0.1.0-py3-none-any.whl","has_sig":false,"md5_digest":"a5d8272b37ce52ea185393b459a98617","packagetype":"bdist_wheel","python_version":"py3","requires_python":">=3.6","size":4731,"upload_time":"2022-01-25T00:01:47","upload_time_iso_8601":"2022-01-25T00:01:47.363449Z","url":"https://files.pythonhosted.org/packages/de/6c/612eb7ea8f5e717a2215a91ecf7ece5a6b462a9d366a74c2a3a0e60a0117/brainstem-0.1.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"334e3d74264b26fc52e08d00fdc0f6ae02843b45c90e2e6f9463fce0422053fd","md5":"d38662dc3694264ffc55a157c72ea5eb","sha256":"9783576801b4020efdb09253f15dbc3494af2dbfac9f291b27299987d6ac2cc6"},"downloads":-1,"filename":"brainstem-0.1.0.tar.gz","has_sig":false,"md5_digest":"d38662dc3694264ffc55a157c72ea5eb","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":4368,"upload_time":"2022-01-25T00:01:49","upload_time_iso_8601":"2022-01-25T00:01:49.050255Z","url":"https://files.pythonhosted.org/packages/33/4e/3d74264b26fc52e08d00fdc0f6ae02843b45c90e2e6f9463fce0422053fd/brainstem-0.1.0.tar.gz","yanked":false,"yanked_reason":null}],"2.10.0":[{"comment_text":"","digests":{"blake2b_256":"7fed67f85241f709974d4986d4dd266a5b6f74b3d04e9dccf7e6f98c03f99f5e","md5":"fdca5bf63b98426e86af502cd1c78280","sha256":"e108c2623e757e5118b602166688ecd95b68757bfb955b86f8706942328c5ca1"},"downloads":-1,"filename":"brainstem-2.10.0-py2.py3-none-any.whl","has_sig":false,"md5_digest":"fdca5bf63b98426e86af502cd1c78280","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10466454,"upload_time":"2023-08-16T21:31:45","upload_time_iso_8601":"2023-08-16T21:31:45.057784Z","url":"https://files.pythonhosted.org/packages/7f/ed/67f85241f709974d4986d4dd266a5b6f74b3d04e9dccf7e6f98c03f99f5e/brainstem-2.10.0-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.1":[{"comment_text":"","digests":{"blake2b_256":"2d9815c451d79f2e7ad00a6295dc8d9377e5101152f1e9af038e9d0d0f73cff6","md5":"cb8de47a4435dd48e98aa9d18bfa4684","sha256":"95e97b6e1da433dacb1d1b8707e6cfe578510b0aebf8e9e159581bd2bd34db31"},"downloads":-1,"filename":"brainstem-2.10.1-py2.py3-none-any.whl","has_sig":false,"md5_digest":"cb8de47a4435dd48e98aa9d18bfa4684","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10468949,"upload_time":"2023-09-29T19:22:03","upload_time_iso_8601":"2023-09-29T19:22:03.632738Z","url":"https://files.pythonhosted.org/packages/2d/98/15c451d79f2e7ad00a6295dc8d9377e5101152f1e9af038e9d0d0f73cff6/brainstem-2.10.1-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.2":[{"comment_text":"","digests":{"blake2b_256":"bf103795e0477c1f7ced75b0b3b9d2db206c6a8a9a60a9d322a22ce783cf6ed0","md5":"2cee9c72d52af046a8c22b20e4c23c45","sha256":"24151af955303fe4f58c6c6bbd47d4259e7dea3cc87aff9b0b069b1177154ee2"},"downloads":-1,"filename":"brainstem-2.10.2-py2.py3-none-any.whl","has_sig":false,"md5_digest":"2cee9c72d52af046a8c22b20e4c23c45","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10750447,"upload_time":"2023-11-02T20:02:53","upload_time_iso_8601":"2023-11-02T20:02:53.557892Z","url":"https://files.pythonhosted.org/packages/bf/10/3795e0477c1f7ced75b0b3b9d2db206c6a8a9a60a9d322a22ce783cf6ed0/brainstem-2.10.2-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.3":[{"comment_text":"","digests":{"blake2b_256":"b8609ae9272c37ff31c4f805837e6aced1e315806d5ceab992fe3da94ec3ee34","md5":"62ca1513a691dfc1aeb65b3594067d94","sha256":"5b394b05996217261a628f63d184c833aa00998993d549d21b2fe6842dab890f"},"downloads":-1,"filename":"brainstem-2.10.3-py2.py3-none-any.whl","has_sig":false,"md5_digest":"62ca1513a691dfc1aeb65b3594067d94","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10772490,"upload_time":"2024-01-08T23:12:11","upload_time_iso_8601":"2024-01-08T23:12:11.373486Z","url":"https://files.pythonhosted.org/packages/b8/60/9ae9272c37ff31c4f805837e6aced1e315806d5ceab992fe3da94ec3ee34/brainstem-2.10.3-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.4":[{"comment_text":"","digests":{"blake2b_256":"3db3a8d90c8015709f9204fdec3ff1df1acc16d0e4c75148e57a6d6c7a13325f","md5":"3d78ec247c2f65697235a825886258b2","sha256":"b4cf1c39f00a56c50192646f570fb12b1764ae94190653588311359cab80ab09"},"downloads":-1,"filename":"brainstem-2.10.4-py2.py3-none-any.whl","has_sig":false,"md5_digest":"3d78ec247c2f65697235a825886258b2","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10772457,"upload_time":"2024-01-24T00:03:27","upload_time_iso_8601":"2024-01-24T00:03:27.342557Z","url":"https://files.pythonhosted.org/packages/3d/b3/a8d90c8015709f9204fdec3ff1df1acc16d0e4c75148e57a6d6c7a13325f/brainstem-2.10.4-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.5":[{"comment_text":"","digests":{"blake2b_256":"870a12c701d6594ab1c23036496f85b22d9afd473fb54ac450969a77e9b6e0fe","md5":"31942271ac3fa99bbd5018f2b3053c93","sha256":"c166df61eadbc069b66b6950699fe6a675db182167fec9f841a78c0a7b692383"},"downloads":-1,"filename":"brainstem-2.10.5-py2.py3-none-any.whl","has_sig":false,"md5_digest":"31942271ac3fa99bbd5018f2b3053c93","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10774375,"upload_time":"2024-03-11T18:17:30","upload_time_iso_8601":"2024-03-11T18:17:30.368434Z","url":"https://files.pythonhosted.org/packages/87/0a/12c701d6594ab1c23036496f85b22d9afd473fb54ac450969a77e9b6e0fe/brainstem-2.10.5-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.6":[{"comment_text":"","digests":{"blake2b_256":"4522476c98a13c4b178d60ae1fc5197b493640f36a674f3a37c441cc51223a35","md5":"35e2bb1c2005568faa868f53ce9422d4","sha256":"dbf69a2dd1d5d76091addd123923403e584d847b3ef48ed408a6c4c4d208058d"},"downloads":-1,"filename":"brainstem-2.10.6-py2.py3-none-any.whl","has_sig":false,"md5_digest":"35e2bb1c2005568faa868f53ce9422d4","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":10774371,"upload_time":"2024-03-18T16:00:40","upload_time_iso_8601":"2024-03-18T16:00:40.663073Z","url":"https://files.pythonhosted.org/packages/45/22/476c98a13c4b178d60ae1fc5197b493640f36a674f3a37c441cc51223a35/brainstem-2.10.6-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.10.7":[{"comment_text":"","digests":{"blake2b_256":"07f613711a8aa57d597fe84e062d6161adca662eee3fc3a4757a47f87b288adf","md5":"4dacb83c87b848656da4bc9b2147904e","sha256":"f803f908fb6a4ffb4017899955da6350bda2ec47797d7c3ac72a89416fa00a40"},"downloads":-1,"filename":"brainstem-2.10.7-py2.py3-none-any.whl","has_sig":false,"md5_digest":"4dacb83c87b848656da4bc9b2147904e","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":11705955,"upload_time":"2024-05-07T19:13:13","upload_time_iso_8601":"2024-05-07T19:13:13.148347Z","url":"https://files.pythonhosted.org/packages/07/f6/13711a8aa57d597fe84e062d6161adca662eee3fc3a4757a47f87b288adf/brainstem-2.10.7-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.21":[{"comment_text":"","digests":{"blake2b_256":"47a122430f3c320e6329f5b843e16bea8e30d07b92de72ebeb1f6e81ba7f907f","md5":"b0a230be4736c1c621c6cff4c87309e7","sha256":"50b17e6938d80f9aaf236e39a2713f729e8cf308f36a72e0c06fb36f4900b322"},"downloads":-1,"filename":"brainstem-2.9.21-py2.py3-none-any.whl","has_sig":false,"md5_digest":"b0a230be4736c1c621c6cff4c87309e7","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3223501,"upload_time":"2022-10-04T19:51:56","upload_time_iso_8601":"2022-10-04T19:51:56.357213Z","url":"https://files.pythonhosted.org/packages/47/a1/22430f3c320e6329f5b843e16bea8e30d07b92de72ebeb1f6e81ba7f907f/brainstem-2.9.21-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.22":[{"comment_text":"","digests":{"blake2b_256":"251f6e6df47341b4222a47f9ec72504b9977735f6f9d90f60f715182970488a0","md5":"fe276660ab57c515415f2df247afb6af","sha256":"46ea6f3df651a4dbdfaf1906d5ba3f9057cf9dea882722bdfc65d3b3df2817b7"},"downloads":-1,"filename":"brainstem-2.9.22-py2.py3-none-any.whl","has_sig":false,"md5_digest":"fe276660ab57c515415f2df247afb6af","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":2919902,"upload_time":"2022-10-10T19:38:10","upload_time_iso_8601":"2022-10-10T19:38:10.260340Z","url":"https://files.pythonhosted.org/packages/25/1f/6e6df47341b4222a47f9ec72504b9977735f6f9d90f60f715182970488a0/brainstem-2.9.22-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.23":[{"comment_text":"","digests":{"blake2b_256":"d7c2ee1aebda1962c3e41fb586b53f27c97ba14cd069fb15a51885c025134d8c","md5":"86815f0584eebc3ec8e535d31f2a3a8d","sha256":"473a7c8f458d561465cb9cfd3d26e215655030d09ab590f05d433a4aabf4e299"},"downloads":-1,"filename":"brainstem-2.9.23-py2.py3-none-any.whl","has_sig":false,"md5_digest":"86815f0584eebc3ec8e535d31f2a3a8d","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3506776,"upload_time":"2022-11-08T23:21:01","upload_time_iso_8601":"2022-11-08T23:21:01.296460Z","url":"https://files.pythonhosted.org/packages/d7/c2/ee1aebda1962c3e41fb586b53f27c97ba14cd069fb15a51885c025134d8c/brainstem-2.9.23-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.24":[{"comment_text":"","digests":{"blake2b_256":"31b5fe9fe988a21ba1a07527c029f535106840eaf17c1991ac77909ca8e38e04","md5":"a8b89e91d6fcef09dd4f9aebb4b8e491","sha256":"9b5159577359f29eb144afc004889b5679c568f1d02092c5c9de3fa02df23cae"},"downloads":-1,"filename":"brainstem-2.9.24-py2.py3-none-any.whl","has_sig":false,"md5_digest":"a8b89e91d6fcef09dd4f9aebb4b8e491","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3509968,"upload_time":"2022-12-02T18:58:40","upload_time_iso_8601":"2022-12-02T18:58:40.161594Z","url":"https://files.pythonhosted.org/packages/31/b5/fe9fe988a21ba1a07527c029f535106840eaf17c1991ac77909ca8e38e04/brainstem-2.9.24-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.25":[{"comment_text":"","digests":{"blake2b_256":"e6c5043e9ae1ecdbc26048f752c17619c485636e40048090831bf0743832a96a","md5":"3fe0a4d721a6041790282d3657758f9b","sha256":"6e3c3eca7e334b8cff6f4c35ebb715dcefdcc8eb98244e632f7bc149a73bc425"},"downloads":-1,"filename":"brainstem-2.9.25-py2.py3-none-any.whl","has_sig":false,"md5_digest":"3fe0a4d721a6041790282d3657758f9b","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3555582,"upload_time":"2022-12-19T23:06:44","upload_time_iso_8601":"2022-12-19T23:06:44.683757Z","url":"https://files.pythonhosted.org/packages/e6/c5/043e9ae1ecdbc26048f752c17619c485636e40048090831bf0743832a96a/brainstem-2.9.25-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.26":[{"comment_text":"","digests":{"blake2b_256":"ad5be424096e6cc89743bb23e5b520bd155b85cf24155abc12b7eb932b0d7eaf","md5":"2eb86413012a2c02508acda2ac0219df","sha256":"e4a132189703400da1f7d53c601bb45057412ecd48cdf1527863c6636704249f"},"downloads":-1,"filename":"brainstem-2.9.26-py2.py3-none-any.whl","has_sig":false,"md5_digest":"2eb86413012a2c02508acda2ac0219df","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3555515,"upload_time":"2023-01-22T19:38:54","upload_time_iso_8601":"2023-01-22T19:38:54.004403Z","url":"https://files.pythonhosted.org/packages/ad/5b/e424096e6cc89743bb23e5b520bd155b85cf24155abc12b7eb932b0d7eaf/brainstem-2.9.26-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.27":[{"comment_text":"","digests":{"blake2b_256":"061c3c96f0818f212f4c778b45fc91ae21718b0a96857e6d5e05541071500ab9","md5":"ed2277b44baac9491b49f03893d4f6a2","sha256":"b5a37ada85b97baab55a6d73cfd2cd65cbbef41c67ffddd121d8ff2b59f505db"},"downloads":-1,"filename":"brainstem-2.9.27-py2.py3-none-any.whl","has_sig":false,"md5_digest":"ed2277b44baac9491b49f03893d4f6a2","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3563275,"upload_time":"2023-02-23T23:51:30","upload_time_iso_8601":"2023-02-23T23:51:30.844216Z","url":"https://files.pythonhosted.org/packages/06/1c/3c96f0818f212f4c778b45fc91ae21718b0a96857e6d5e05541071500ab9/brainstem-2.9.27-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.28":[{"comment_text":"","digests":{"blake2b_256":"5beef36a9bc0b2f50a6c2b9e23991b017ecc6d19be5b0807e39c26152cbfba67","md5":"409dc145e66cf8bf30a5273353831fb2","sha256":"522411b274e9b9fe92d227ae3d855ea6ddcaf198f38108d568c50f5cff700a43"},"downloads":-1,"filename":"brainstem-2.9.28-py2.py3-none-any.whl","has_sig":false,"md5_digest":"409dc145e66cf8bf30a5273353831fb2","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3567909,"upload_time":"2023-03-29T02:05:56","upload_time_iso_8601":"2023-03-29T02:05:56.119248Z","url":"https://files.pythonhosted.org/packages/5b/ee/f36a9bc0b2f50a6c2b9e23991b017ecc6d19be5b0807e39c26152cbfba67/brainstem-2.9.28-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"2.9.29":[{"comment_text":"","digests":{"blake2b_256":"0bf76977d46559e814956ad3a1ce45a6445274574e3faa16aec385a58fe27de4","md5":"649afa7d1b8f62d3643b446ac046eb68","sha256":"5d4ca0fbb965fb5b62158e467e2dad1600280c346b98f4ea28663a3fd8b8b272"},"downloads":-1,"filename":"brainstem-2.9.29-py2.py3-none-any.whl","has_sig":false,"md5_digest":"649afa7d1b8f62d3643b446ac046eb68","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":3568061,"upload_time":"2023-04-24T15:27:33","upload_time_iso_8601":"2023-04-24T15:27:33.782454Z","url":"https://files.pythonhosted.org/packages/0b/f7/6977d46559e814956ad3a1ce45a6445274574e3faa16aec385a58fe27de4/brainstem-2.9.29-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}]},"urls":[{"comment_text":"","digests":{"blake2b_256":"07f613711a8aa57d597fe84e062d6161adca662eee3fc3a4757a47f87b288adf","md5":"4dacb83c87b848656da4bc9b2147904e","sha256":"f803f908fb6a4ffb4017899955da6350bda2ec47797d7c3ac72a89416fa00a40"},"downloads":-1,"filename":"brainstem-2.10.7-py2.py3-none-any.whl","has_sig":false,"md5_digest":"4dacb83c87b848656da4bc9b2147904e","packagetype":"bdist_wheel","python_version":"py2.py3","requires_python":null,"size":11705955,"upload_time":"2024-05-07T19:13:13","upload_time_iso_8601":"2024-05-07T19:13:13.148347Z","url":"https://files.pythonhosted.org/packages/07/f6/13711a8aa57d597fe84e062d6161adca662eee3fc3a4757a47f87b288adf/brainstem-2.10.7-py2.py3-none-any.whl","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}
