{"info":{"author":"Antony Lewis","author_email":null,"bugtrack_url":null,"classifiers":["Development Status :: 5 - Production/Stable","Environment :: Console","Intended Audience :: Science/Research","License :: OSI Approved :: GNU Lesser General Public License v3 (LGPLv3)","Operating System :: OS Independent","Programming Language :: Python :: 3.10","Programming Language :: Python :: 3.11","Programming Language :: Python :: 3.12","Programming Language :: Python :: 3.7","Programming Language :: Python :: 3.8","Programming Language :: Python :: 3.9","Topic :: Scientific/Engineering :: Astronomy"],"description":"===================\nGetDist\n===================\n:GetDist: MCMC sample analysis, plotting and GUI\n:Author: Antony Lewis\n:Homepage: https://getdist.readthedocs.io\n:Source: https://github.com/cmbant/getdist\n:Reference: https://arxiv.org/abs/1910.13970\n\n.. image:: https://img.shields.io/travis/com/cmbant/getdist\n   :target: https://app.travis-ci.com/cmbant/getdist\n.. image:: https://img.shields.io/pypi/v/GetDist.svg?style=flat\n   :target: https://pypi.python.org/pypi/GetDist/\n.. image:: https://readthedocs.org/projects/getdist/badge/?version=latest\n   :target: https://getdist.readthedocs.io/en/latest\n.. image:: https://mybinder.org/badge_logo.svg\n   :target: https://mybinder.org/v2/gh/cmbant/getdist/master?filepath=docs%2Fplot_gallery.ipynb\n.. image:: https://img.shields.io/badge/arXiv-1910.13970-b31b1b.svg?color=0B6523\n   :target: https://arxiv.org/abs/1910.13970\n\nDescription\n============\n\nGetDist is a Python package for analysing Monte Carlo samples, including correlated samples\nfrom Markov Chain Monte Carlo (MCMC).\n\n* **Point and click GUI** - select chain files, view plots, marginalized constraints, LaTeX tables and more\n* **Plotting library** - make custom publication-ready 1D, 2D, 3D-scatter, triangle and other plots\n* **Named parameters** - simple handling of many parameters using parameter names, including LaTeX labels and prior bounds\n* **Optimized Kernel Density Estimation** - automated optimal bandwidth choice for 1D and 2D densities (Botev et al. Improved Sheather-Jones method), with boundary and bias correction\n* **Convergence diagnostics** - including correlation length and diagonalized Gelman-Rubin statistics\n* **LaTeX tables** for marginalized 1D constraints\n\nSee the `Plot Gallery and tutorial <http://getdist.readthedocs.io/en/latest/plot_gallery.html>`_\n(`run online <https://mybinder.org/v2/gh/cmbant/getdist/master?filepath=docs%2Fplot_gallery.ipynb>`_)\nand `GetDist Documentation <http://getdist.readthedocs.io/en/latest/index.html>`_.\n\n\nGetting Started\n================\n\nInstall getdist using pip::\n\n    $ pip install getdist\n\nor from source files using::\n\n    $ python setup.py install\n\nor::\n\n    $ pip install -e /path/to/source/\n\nYou can test if things are working using the unit test by running::\n\n    $ python -m unittest getdist.tests.getdist_test\n\nCheck the dependencies listed in the next section are installed. You can then use the getdist module from your scripts, or\nuse the GetDist GUI (*getdist-gui* command).\n\nOnce installed, the best way to get up to speed is probably to read through\nthe `Plot Gallery and tutorial <http://getdist.readthedocs.io/en/latest/plot_gallery.html>`_.\n\nDependencies\n=============\n* Python 3.7+\n* matplotlib\n* scipy\n* PySide6 or PySide2 - optional, only needed for GUI\n* Working LaTeX installation (not essential, only for some plotting/table functions)\n\nPython distributions like Anaconda have most of what you need (except for LaTeX).\n\nTo use the `GUI <https://getdist.readthedocs.io/en/latest/gui.html>`_ you need PySide.\nSee the `GUI docs <https://getdist.readthedocs.io/en/latest/gui.html#installation>`_ for suggestions on how to install.\n\nAlgorithm details\n==================\n\nDetails of kernel density estimation (KDE) algorithms and references are give in the GetDist notes\n`arXiv:1910.13970 <https://arxiv.org/pdf/1910.13970>`_.\n\nSamples file format\n===================\n\nGetDist can be used in scripts and interactively with standard numpy arrays\n(as in the `examples <http://getdist.readthedocs.io/en/latest/plot_gallery.html>`_).\nScripts and the `GetDist GUI <http://getdist.readthedocs.io/en/latest/gui.html>`_ can also read parameter sample/chain files in plain text format\n(or in the format output by the `Cobaya <https://cobaya.readthedocs.io>`__ sampling program).\nIn general plain text files of the form::\n\n  xxx_1.txt\n  xxx_2.txt\n  ...\n  xxx.paramnames\n  xxx.ranges\n\nwhere \"xxx\" is some root file name.\n\nThe .txt files are separate chain files (there can also be just one xxx.txt file). Each row of each sample .txt file is in the format\n\n  *weight like param1 param2 param3* ...\n\nThe *weight* gives the number of samples (or importance weight) with these parameters. *like* gives -log(likelihood), and *param1, param2...* are the values of the parameters at the sample point. The first two columns can be 1 and 0 if they are not known or used.\n\nThe .paramnames file lists the names of the parameters, one per line, optionally followed by a LaTeX label. Names cannot include spaces, and if they end in \"*\" they are interpreted as derived (rather than MCMC) parameters, e.g.::\n\n x1   x_1\n y1   y_1\n x2   x_2\n xy*  x_1+y_1\n\nThe .ranges file gives hard bounds for the parameters, e.g.::\n\n x1  -5 5\n x2   0 N\n\nNote that not all parameters need to be specified, and \"N\" can be used to denote that a particular upper or lower limit is unbounded. The ranges are used to determine densities and plot bounds if there are samples near the boundary; if there are no samples anywhere near the boundary the ranges have no affect on plot bounds, which are chosen appropriately for the range of the samples.\n\nThere can also optionally be a .properties.ini file, which can specify *burn_removed=T* to ensure no burn in is removed, or *ignore_rows=x* to ignore the first\nfraction *x* of the file rows (or if *x > 1*, the specified number of rows).\n\nLoading samples\n===================\n\nTo load an MCSamples object from text files do::\n\n     from getdist import loadMCSamples\n     samples = loadMCSamples('/path/to/xxx', settings={'ignore_rows':0.3})\n\nHere *settings* gives optional parameter settings for the analysis. *ignore_rows* is useful for MCMC chains where you want to\ndiscard some fraction from the start of each chain as burn in (use a number >1 to discard a fixed number of sample lines rather than a fraction).\nThe MCSamples object can be passed to plot functions, or used to get many results. For example, to plot marginalized parameter densities\nfor parameter names *x1* and *x2*::\n\n    from getdist import plots\n    g = plots.get_single_plotter()\n    g.plot_2d(samples, ['x1', 'x2'])\n\nWhen you have many different chain files in the same directory,\nplotting can work directly with the root file names. For example to compare *x* and *y* constraints\nfrom two chains with root names *xxx* and *yyy*::\n\n    from getdist import plots\n    g = plots.get_single_plotter(chain_dir='/path/to/', analysis_settings={'ignore_rows':0.3})\n    g.plot_2d(['xxx','yyy'], ['x', 'y'])\n\n\nMCSamples objects can also be constructed directly from numpy arrays in memory, see the example\nin the `Plot Gallery <https://getdist.readthedocs.io/en/latest/plot_gallery.html>`_.\n\nGetDist script\n===================\n\nIf you have chain files on on disk, you can also quickly calculate convergence and marginalized statistics using the *getdist* script:\n\n    usage: getdist [-h] [--ignore_rows IGNORE_ROWS] [-V] [ini_file] [chain_root]\n\n    GetDist sample analyser\n\n    positional arguments:\n      *ini_file*              .ini file with analysis settings (optional, if omitted uses defaults\n\n      *chain_root*            Root name of chain to analyse (e.g. chains/test), required unless file_root specified in ini_file\n\n    optional arguments:\n      -h, --help            show this help message and exit\n      --ignore_rows IGNORE_ROWS\n                            set initial fraction of chains to cut as burn in\n                            (fraction of total rows, or >1 number of rows);\n                            overrides any value in ini_file if set\n      --make_param_file MAKE_PARAM_FILE\n                        Produce a sample distparams.ini file that you can edit\n                        and use when running GetDist\n      -V, --version         show program's version number and exit\n\nwhere *ini_file* is optionally a .ini file listing *key=value* parameter option values, and chain_root is the root file name of the chains.\nFor example::\n\n   getdist distparams.ini chains/test_chain\n\nThis produces a set of files containing parameter means and limits (.margestats), N-D likelihood contour boundaries and best-fit sample (.likestats),\nconvergence diagnostics (.converge), parameter covariance and correlation (.covmat and .corr), and optionally various simple plotting scripts.\nIf no *ini_file* is given, default settings are used. The *ignore_rows* option allows some of the start of each chain file to be removed as burn in.\n\nTo customize settings you can run::\n\n   getdist --make_param_file distparams.ini\n\nto produce the setting file distparams.ini, edit it, then run with your custom settings.\n\nGetDist GUI\n===================\n\nRun *getdist-gui* to run the graphical user interface. This requires PySide, but will run on Windows, Linux and Mac.\nIt allows you to open a folder of chain files, then easily select, open, plot and compare, as well as viewing standard GetDist outputs and tables.\nSee the `GUI Readme <http://getdist.readthedocs.io/en/latest/gui.html>`_.\n\n\nUsing with CosmoMC and Cobaya\n=============================\n\nThis GetDist package is general, but is mainly developed for analysing chains from the `CosmoMC <https://cosmologist.info/cosmomc>`_\nand `Cobaya <https://cobaya.readthedocs.io/>`_ sampling programs.\nNo need to install this package separately if you have a full CosmoMC installation; the Cobaya installation will also install GetDist as a dependency.\nDetailed help is available for plotting Planck chains\nand using CosmoMC parameter grids in the `Readme <https://cosmologist.info/cosmomc/readme_python.html>`_.\n\nCitation\n===================\nYou can refer to the notes::\n\n     @article{Lewis:2019xzd,\n      author         = \"Lewis, Antony\",\n      title          = \"{GetDist: a Python package for analysing Monte Carlo\n                        samples}\",\n      year           = \"2019\",\n      eprint         = \"1910.13970\",\n      archivePrefix  = \"arXiv\",\n      primaryClass   = \"astro-ph.IM\",\n      SLACcitation   = \"%%CITATION = ARXIV:1910.13970;%%\",\n      url            = \"https://getdist.readthedocs.io\"\n     }\n\n\nand references therein as appropriate.\n\n===================\n\n.. image:: https://raw.githubusercontent.com/CobayaSampler/cobaya/master/img/Sussex_white.svg\n   :alt: University of Sussex\n   :target: https://www.sussex.ac.uk/astronomy/\n   :height: 200px\n   :width: 200px\n\n.. image:: https://raw.githubusercontent.com/CobayaSampler/cobaya/master/img/ERC_white.svg\n   :alt: European Research Council\n   :target: https://erc.europa.eu/\n   :height: 200px\n   :width: 200px\n\n.. image:: https://cdn.cosmologist.info/antony/STFC_white.svg\n   :alt: STFC\n   :target: https://stfc.ukri.org/\n   :height: 200px\n   :width: 200px\n","description_content_type":"text/x-rst","docs_url":null,"download_url":null,"downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":null,"keywords":"MCMC, KDE, sample, density estimation, plot, figure","license":"GetDist, Copyright (c) 2019, Antony Lewis  Code to find optimal bandwidths for basic kernel density estimators in 1 and 2D was adapted from Matlab code by Zdravko Botev. Original code notice:  Copyright (c) 2007, Zdravko Botev All rights reserved.  Redistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:  * Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer. * Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution * Neither the name of the The University of Queensland nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.  LICENSING -------------------------------  You are licensed to use this software free of charge within the terms of the LGPL (see below), with these additional conditions:  - Any physics publication using results of the code must be submitted to arXiv.org at the same time as, or before, submitting to a journal. arXiv must be updated with a version equivalent to that accepted by the journal on journal acceptance.  - If you identify any bugs you report them as soon as confirmed  - This license, the above copyright notices and disclaimer appear on ALL copies of the software and documentation, including modifications that you make for internal use or for distribution   The documentation of this program is released under the GNU Free Documentation License (see below)   For this code and its documentation (with the exceptions above): ----------------------------------------------------------------  This program is free software: you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation, either version 3 of the License, or any later version.  This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License for more details.  The documentation of this program is released under the GNU Free Documentation License. Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts.  ------------------------------------------------------------------------  GNU LESSER GENERAL PUBLIC LICENSE Version 3, 29 June 2007  Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/> Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.   This version of the GNU Lesser General Public License incorporates the terms and conditions of version 3 of the GNU General Public License, supplemented by the additional permissions listed below.  0. Additional Definitions.  As used herein, \"this License\" refers to version 3 of the GNU Lesser General Public License, and the \"GNU GPL\" refers to version 3 of the GNU General Public License.  \"The Library\" refers to a covered work governed by this License, other than an Application or a Combined Work as defined below.  An \"Application\" is any work that makes use of an interface provided by the Library, but which is not otherwise based on the Library. Defining a subclass of a class defined by the Library is deemed a mode of using an interface provided by the Library.  A \"Combined Work\" is a work produced by combining or linking an Application with the Library.  The particular version of the Library with which the Combined Work was made is also called the \"Linked Version\".  The \"Minimal Corresponding Source\" for a Combined Work means the Corresponding Source for the Combined Work, excluding any source code for portions of the Combined Work that, considered in isolation, are based on the Application, and not on the Linked Version.  The \"Corresponding Application Code\" for a Combined Work means the object code and/or source code for the Application, including any data and utility programs needed for reproducing the Combined Work from the Application, but excluding the System Libraries of the Combined Work.  1. Exception to Section 3 of the GNU GPL.  You may convey a covered work under sections 3 and 4 of this License without being bound by section 3 of the GNU GPL.  2. Conveying Modified Versions.  If you modify a copy of the Library, and, in your modifications, a facility refers to a function or data to be supplied by an Application that uses the facility (other than as an argument passed when the facility is invoked), then you may convey a copy of the modified version:  a) under this License, provided that you make a good faith effort to ensure that, in the event an Application does not supply the function or data, the facility still operates, and performs whatever part of its purpose remains meaningful, or  b) under the GNU GPL, with none of the additional permissions of this License applicable to that copy.  3. Object Code Incorporating Material from Library Header Files.  The object code form of an Application may incorporate material from a header file that is part of the Library.  You may convey such object code under terms of your choice, provided that, if the incorporated material is not limited to numerical parameters, data structure layouts and accessors, or small macros, inline functions and templates (ten or fewer lines in length), you do both of the following:  a) Give prominent notice with each copy of the object code that the Library is used in it and that the Library and its use are covered by this License.  b) Accompany the object code with a copy of the GNU GPL and this license document.  4. Combined Works.  You may convey a Combined Work under terms of your choice that, taken together, effectively do not restrict modification of the portions of the Library contained in the Combined Work and reverse engineering for debugging such modifications, if you also do each of the following:  a) Give prominent notice with each copy of the Combined Work that the Library is used in it and that the Library and its use are covered by this License.  b) Accompany the Combined Work with a copy of the GNU GPL and this license document.  c) For a Combined Work that displays copyright notices during execution, include the copyright notice for the Library among these notices, as well as a reference directing the user to the copies of the GNU GPL and this license document.  d) Do one of the following:  0) Convey the Minimal Corresponding Source under the terms of this License, and the Corresponding Application Code in a form suitable for, and under terms that permit, the user to recombine or relink the Application with a modified version of the Linked Version to produce a modified Combined Work, in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.  1) Use a suitable shared library mechanism for linking with the Library.  A suitable mechanism is one that (a) uses at run time a copy of the Library already present on the user's computer system, and (b) will operate properly with a modified version of the Library that is interface-compatible with the Linked Version.  e) Provide Installation Information, but only if you would otherwise be required to provide such information under section 6 of the GNU GPL, and only to the extent that such information is necessary to install and execute a modified version of the Combined Work produced by recombining or relinking the Application with a modified version of the Linked Version. (If you use option 4d0, the Installation Information must accompany the Minimal Corresponding Source and Corresponding Application Code. If you use option 4d1, you must provide the Installation Information in the manner specified by section 6 of the GNU GPL for conveying Corresponding Source.)  5. Combined Libraries.  You may place library facilities that are a work based on the Library side by side in a single library together with other library facilities that are not Applications and are not covered by this License, and convey such a combined library under terms of your choice, if you do both of the following:  a) Accompany the combined library with a copy of the same work based on the Library, uncombined with any other library facilities, conveyed under the terms of this License.  b) Give prominent notice with the combined library that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.  6. Revised Versions of the GNU Lesser General Public License.  The Free Software Foundation may publish revised and/or new versions of the GNU Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.  Each version is given a distinguishing version number. If the Library as you received it specifies that a certain numbered version of the GNU Lesser General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that published version or of any later version published by the Free Software Foundation. If the Library as you received it does not specify a version number of the GNU Lesser General Public License, you may choose any version of the GNU Lesser General Public License ever published by the Free Software Foundation.  If the Library as you received it specifies that a proxy can decide whether future versions of the GNU Lesser General Public License shall apply, that proxy's public statement of acceptance of any version is permanent authorization for you to choose that version for the Library.   ------------------------------------------------------------------------  GNU GENERAL PUBLIC LICENSE Version 3, 29 June 2007  Copyright (C) 2007 Free Software Foundation, Inc. <http://fsf.org/> Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.  Preamble  The GNU General Public License is a free, copyleft license for software and other kinds of works.  The licenses for most software and other practical works are designed to take away your freedom to share and change the works.  By contrast, the GNU General Public License is intended to guarantee your freedom to share and change all versions of a program--to make sure it remains free software for all its users.  We, the Free Software Foundation, use the GNU General Public License for most of our software; it applies also to any other work released this way by its authors.  You can apply it to your programs, too.  When we speak of free software, we are referring to freedom, not price.  Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for them if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs, and that you know you can do these things.  To protect your rights, we need to prevent others from denying you these rights or asking you to surrender the rights.  Therefore, you have certain responsibilities if you distribute copies of the software, or if you modify it: responsibilities to respect the freedom of others.  For example, if you distribute copies of such a program, whether gratis or for a fee, you must pass on to the recipients the same freedoms that you received.  You must make sure that they, too, receive or can get the source code.  And you must show them these terms so they know their rights.  Developers that use the GNU GPL protect your rights with two steps: (1) assert copyright on the software, and (2) offer you this License giving you legal permission to copy, distribute and/or modify it.  For the developers' and authors' protection, the GPL clearly explains that there is no warranty for this free software.  For both users' and authors' sake, the GPL requires that modified versions be marked as changed, so that their problems will not be attributed erroneously to authors of previous versions.  Some devices are designed to deny users access to install or run modified versions of the software inside them, although the manufacturer can do so.  This is fundamentally incompatible with the aim of protecting users' freedom to change the software.  The systematic pattern of such abuse occurs in the area of products for individuals to use, which is precisely where it is most unacceptable.  Therefore, we have designed this version of the GPL to prohibit the practice for those products.  If such problems arise substantially in other domains, we stand ready to extend this provision to those domains in future versions of the GPL, as needed to protect the freedom of users.  Finally, every program is threatened constantly by software patents. States should not allow patents to restrict development and use of software on general-purpose computers, but in those that do, we wish to avoid the special danger that patents applied to a free program could make it effectively proprietary.  To prevent this, the GPL assures that patents cannot be used to render the program non-free.  The precise terms and conditions for copying, distribution and modification follow.  TERMS AND CONDITIONS  0. Definitions.  \"This License\" refers to version 3 of the GNU General Public License.  \"Copyright\" also means copyright-like laws that apply to other kinds of works, such as semiconductor masks.  \"The Program\" refers to any copyrightable work licensed under this License.  Each licensee is addressed as \"you\".  \"Licensees\" and \"recipients\" may be individuals or organizations.  To \"modify\" a work means to copy from or adapt all or part of the work in a fashion requiring copyright permission, other than the making of an exact copy.  The resulting work is called a \"modified version\" of the earlier work or a work \"based on\" the earlier work.  A \"covered work\" means either the unmodified Program or a work based on the Program.  To \"propagate\" a work means to do anything with it that, without permission, would make you directly or secondarily liable for infringement under applicable copyright law, except executing it on a computer or modifying a private copy.  Propagation includes copying, distribution (with or without modification), making available to the public, and in some countries other activities as well.  To \"convey\" a work means any kind of propagation that enables other parties to make or receive copies.  Mere interaction with a user through a computer network, with no transfer of a copy, is not conveying.  An interactive user interface displays \"Appropriate Legal Notices\" to the extent that it includes a convenient and prominently visible feature that (1) displays an appropriate copyright notice, and (2) tells the user that there is no warranty for the work (except to the extent that warranties are provided), that licensees may convey the work under this License, and how to view a copy of this License.  If the interface presents a list of user commands or options, such as a menu, a prominent item in the list meets this criterion.  1. Source Code.  The \"source code\" for a work means the preferred form of the work for making modifications to it.  \"Object code\" means any non-source form of a work.  A \"Standard Interface\" means an interface that either is an official standard defined by a recognized standards body, or, in the case of interfaces specified for a particular programming language, one that is widely used among developers working in that language.  The \"System Libraries\" of an executable work include anything, other than the work as a whole, that (a) is included in the normal form of packaging a Major Component, but which is not part of that Major Component, and (b) serves only to enable use of the work with that Major Component, or to implement a Standard Interface for which an implementation is available to the public in source code form.  A \"Major Component\", in this context, means a major essential component (kernel, window system, and so on) of the specific operating system (if any) on which the executable work runs, or a compiler used to produce the work, or an object code interpreter used to run it.  The \"Corresponding Source\" for a work in object code form means all the source code needed to generate, install, and (for an executable work) run the object code and to modify the work, including scripts to control those activities.  However, it does not include the work's System Libraries, or general-purpose tools or generally available free programs which are used unmodified in performing those activities but which are not part of the work.  For example, Corresponding Source includes interface definition files associated with source files for the work, and the source code for shared libraries and dynamically linked subprograms that the work is specifically designed to require, such as by intimate data communication or control flow between those subprograms and other parts of the work.  The Corresponding Source need not include anything that users can regenerate automatically from other parts of the Corresponding Source.  The Corresponding Source for a work in source code form is that same work.  2. Basic Permissions.  All rights granted under this License are granted for the term of copyright on the Program, and are irrevocable provided the stated conditions are met.  This License explicitly affirms your unlimited permission to run the unmodified Program.  The output from running a covered work is covered by this License only if the output, given its content, constitutes a covered work.  This License acknowledges your rights of fair use or other equivalent, as provided by copyright law.  You may make, run and propagate covered works that you do not convey, without conditions so long as your license otherwise remains in force.  You may convey covered works to others for the sole purpose of having them make modifications exclusively for you, or provide you with facilities for running those works, provided that you comply with the terms of this License in conveying all material for which you do not control copyright.  Those thus making or running the covered works for you must do so exclusively on your behalf, under your direction and control, on terms that prohibit them from making any copies of your copyrighted material outside their relationship with you.  Conveying under any other circumstances is permitted solely under the conditions stated below.  Sublicensing is not allowed; section 10 makes it unnecessary.  3. Protecting Users' Legal Rights From Anti-Circumvention Law.  No covered work shall be deemed part of an effective technological measure under any applicable law fulfilling obligations under article 11 of the WIPO copyright treaty adopted on 20 December 1996, or similar laws prohibiting or restricting circumvention of such measures.  When you convey a covered work, you waive any legal power to forbid circumvention of technological measures to the extent such circumvention is effected by exercising rights under this License with respect to the covered work, and you disclaim any intention to limit operation or modification of the work as a means of enforcing, against the work's users, your or third parties' legal rights to forbid circumvention of technological measures.  4. Conveying Verbatim Copies.  You may convey verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all notices stating that this License and any non-permissive terms added in accord with section 7 apply to the code; keep intact all notices of the absence of any warranty; and give all recipients a copy of this License along with the Program.  You may charge any price or no price for each copy that you convey, and you may offer support or warranty protection for a fee.  5. Conveying Modified Source Versions.  You may convey a work based on the Program, or the modifications to produce it from the Program, in the form of source code under the terms of section 4, provided that you also meet all of these conditions:  a) The work must carry prominent notices stating that you modified it, and giving a relevant date.  b) The work must carry prominent notices stating that it is released under this License and any conditions added under section 7.  This requirement modifies the requirement in section 4 to \"keep intact all notices\".  c) You must license the entire work, as a whole, under this License to anyone who comes into possession of a copy.  This License will therefore apply, along with any applicable section 7 additional terms, to the whole of the work, and all its parts, regardless of how they are packaged.  This License gives no permission to license the work in any other way, but it does not invalidate such permission if you have separately received it.  d) If the work has interactive user interfaces, each must display Appropriate Legal Notices; however, if the Program has interactive interfaces that do not display Appropriate Legal Notices, your work need not make them do so.  A compilation of a covered work with other separate and independent works, which are not by their nature extensions of the covered work, and which are not combined with it such as to form a larger program, in or on a volume of a storage or distribution medium, is called an \"aggregate\" if the compilation and its resulting copyright are not used to limit the access or legal rights of the compilation's users beyond what the individual works permit.  Inclusion of a covered work in an aggregate does not cause this License to apply to the other parts of the aggregate.  6. Conveying Non-Source Forms.  You may convey a covered work in object code form under the terms of sections 4 and 5, provided that you also convey the machine-readable Corresponding Source under the terms of this License, in one of these ways:  a) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by the Corresponding Source fixed on a durable physical medium customarily used for software interchange.  b) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by a written offer, valid for at least three years and valid for as long as you offer spare parts or customer support for that product model, to give anyone who possesses the object code either (1) a copy of the Corresponding Source for all the software in the product that is covered by this License, on a durable physical medium customarily used for software interchange, for a price no more than your reasonable cost of physically performing this conveying of source, or (2) access to copy the Corresponding Source from a network server at no charge.  c) Convey individual copies of the object code with a copy of the written offer to provide the Corresponding Source.  This alternative is allowed only occasionally and noncommercially, and only if you received the object code with such an offer, in accord with subsection 6b.  d) Convey the object code by offering access from a designated place (gratis or for a charge), and offer equivalent access to the Corresponding Source in the same way through the same place at no further charge.  You need not require recipients to copy the Corresponding Source along with the object code.  If the place to copy the object code is a network server, the Corresponding Source may be on a different server (operated by you or a third party) that supports equivalent copying facilities, provided you maintain clear directions next to the object code saying where to find the Corresponding Source.  Regardless of what server hosts the Corresponding Source, you remain obligated to ensure that it is available for as long as needed to satisfy these requirements.  e) Convey the object code using peer-to-peer transmission, provided you inform other peers where the object code and Corresponding Source of the work are being offered to the general public at no charge under subsection 6d.  A separable portion of the object code, whose source code is excluded from the Corresponding Source as a System Library, need not be included in conveying the object code work.  A \"User Product\" is either (1) a \"consumer product\", which means any tangible personal property which is normally used for personal, family, or household purposes, or (2) anything designed or sold for incorporation into a dwelling.  In determining whether a product is a consumer product, doubtful cases shall be resolved in favor of coverage.  For a particular product received by a particular user, \"normally used\" refers to a typical or common use of that class of product, regardless of the status of the particular user or of the way in which the particular user actually uses, or expects or is expected to use, the product.  A product is a consumer product regardless of whether the product has substantial commercial, industrial or non-consumer uses, unless such uses represent the only significant mode of use of the product.  \"Installation Information\" for a User Product means any methods, procedures, authorization keys, or other information required to install and execute modified versions of a covered work in that User Product from a modified version of its Corresponding Source.  The information must suffice to ensure that the continued functioning of the modified object code is in no case prevented or interfered with solely because modification has been made.  If you convey an object code work under this section in, or with, or specifically for use in, a User Product, and the conveying occurs as part of a transaction in which the right of possession and use of the User Product is transferred to the recipient in perpetuity or for a fixed term (regardless of how the transaction is characterized), the Corresponding Source conveyed under this section must be accompanied by the Installation Information.  But this requirement does not apply if neither you nor any third party retains the ability to install modified object code on the User Product (for example, the work has been installed in ROM).  The requirement to provide Installation Information does not include a requirement to continue to provide support service, warranty, or updates for a work that has been modified or installed by the recipient, or for the User Product in which it has been modified or installed.  Access to a network may be denied when the modification itself materially and adversely affects the operation of the network or violates the rules and protocols for communication across the network.  Corresponding Source conveyed, and Installation Information provided, in accord with this section must be in a format that is publicly documented (and with an implementation available to the public in source code form), and must require no special password or key for unpacking, reading or copying.  7. Additional Terms.  \"Additional permissions\" are terms that supplement the terms of this License by making exceptions from one or more of its conditions. Additional permissions that are applicable to the entire Program shall be treated as though they were included in this License, to the extent that they are valid under applicable law.  If additional permissions apply only to part of the Program, that part may be used separately under those permissions, but the entire Program remains governed by this License without regard to the additional permissions.  When you convey a copy of a covered work, you may at your option remove any additional permissions from that copy, or from any part of it.  (Additional permissions may be written to require their own removal in certain cases when you modify the work.)  You may place additional permissions on material, added by you to a covered work, for which you have or can give appropriate copyright permission.  Notwithstanding any other provision of this License, for material you add to a covered work, you may (if authorized by the copyright holders of that material) supplement the terms of this License with terms:  a) Disclaiming warranty or limiting liability differently from the terms of sections 15 and 16 of this License; or  b) Requiring preservation of specified reasonable legal notices or author attributions in that material or in the Appropriate Legal Notices displayed by works containing it; or  c) Prohibiting misrepresentation of the origin of that material, or requiring that modified versions of such material be marked in reasonable ways as different from the original version; or  d) Limiting the use for publicity purposes of names of licensors or authors of the material; or  e) Declining to grant rights under trademark law for use of some trade names, trademarks, or service marks; or  f) Requiring indemnification of licensors and authors of that material by anyone who conveys the material (or modified versions of it) with contractual assumptions of liability to the recipient, for any liability that these contractual assumptions directly impose on those licensors and authors.  All other non-permissive additional terms are considered \"further restrictions\" within the meaning of section 10.  If the Program as you received it, or any part of it, contains a notice stating that it is governed by this License along with a term that is a further restriction, you may remove that term.  If a license document contains a further restriction but permits relicensing or conveying under this License, you may add to a covered work material governed by the terms of that license document, provided that the further restriction does not survive such relicensing or conveying.  If you add terms to a covered work in accord with this section, you must place, in the relevant source files, a statement of the additional terms that apply to those files, or a notice indicating where to find the applicable terms.  Additional terms, permissive or non-permissive, may be stated in the form of a separately written license, or stated as exceptions; the above requirements apply either way.  8. Termination.  You may not propagate or modify a covered work except as expressly provided under this License.  Any attempt otherwise to propagate or modify it is void, and will automatically terminate your rights under this License (including any patent licenses granted under the third paragraph of section 11).  However, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.  Moreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice.  Termination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License.  If your rights have been terminated and not permanently reinstated, you do not qualify to receive new licenses for the same material under section 10.  9. Acceptance Not Required for Having Copies.  You are not required to accept this License in order to receive or run a copy of the Program.  Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance.  However, nothing other than this License grants you permission to propagate or modify any covered work.  These actions infringe copyright if you do not accept this License.  Therefore, by modifying or propagating a covered work, you indicate your acceptance of this License to do so.  10. Automatic Licensing of Downstream Recipients.  Each time you convey a covered work, the recipient automatically receives a license from the original licensors, to run, modify and propagate that work, subject to this License.  You are not responsible for enforcing compliance by third parties with this License.  An \"entity transaction\" is a transaction transferring control of an organization, or substantially all assets of one, or subdividing an organization, or merging organizations.  If propagation of a covered work results from an entity transaction, each party to that transaction who receives a copy of the work also receives whatever licenses to the work the party's predecessor in interest had or could give under the previous paragraph, plus a right to possession of the Corresponding Source of the work from the predecessor in interest, if the predecessor has it or can get it with reasonable efforts.  You may not impose any further restrictions on the exercise of the rights granted or affirmed under this License.  For example, you may not impose a license fee, royalty, or other charge for exercise of rights granted under this License, and you may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.  11. Patents.  A \"contributor\" is a copyright holder who authorizes use under this License of the Program or a work on which the Program is based.  The work thus licensed is called the contributor's \"contributor version\".  A contributor's \"essential patent claims\" are all patent claims owned or controlled by the contributor, whether already acquired or hereafter acquired, that would be infringed by some manner, permitted by this License, of making, using, or selling its contributor version, but do not include claims that would be infringed only as a consequence of further modification of the contributor version.  For purposes of this definition, \"control\" includes the right to grant patent sublicenses in a manner consistent with the requirements of this License.  Each contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.  In the following three paragraphs, a \"patent license\" is any express agreement or commitment, however denominated, not to enforce a patent (such as an express permission to practice a patent or covenant not to sue for patent infringement).  To \"grant\" such a patent license to a party means to make such an agreement or commitment not to enforce a patent against the party.  If you convey a covered work, knowingly relying on a patent license, and the Corresponding Source of the work is not available for anyone to copy, free of charge and under the terms of this License, through a publicly available network server or other readily accessible means, then you must either (1) cause the Corresponding Source to be so available, or (2) arrange to deprive yourself of the benefit of the patent license for this particular work, or (3) arrange, in a manner consistent with the requirements of this License, to extend the patent license to downstream recipients.  \"Knowingly relying\" means you have actual knowledge that, but for the patent license, your conveying the covered work in a country, or your recipient's use of the covered work in a country, would infringe one or more identifiable patents in that country that you have reason to believe are valid.  If, pursuant to or in connection with a single transaction or arrangement, you convey, or propagate by procuring conveyance of, a covered work, and grant a patent license to some of the parties receiving the covered work authorizing them to use, propagate, modify or convey a specific copy of the covered work, then the patent license you grant is automatically extended to all recipients of the covered work and works based on it.  A patent license is \"discriminatory\" if it does not include within the scope of its coverage, prohibits the exercise of, or is conditioned on the non-exercise of one or more of the rights that are specifically granted under this License.  You may not convey a covered work if you are a party to an arrangement with a third party that is in the business of distributing software, under which you make payment to the third party based on the extent of your activity of conveying the work, and under which the third party grants, to any of the parties who would receive the covered work from you, a discriminatory patent license (a) in connection with copies of the covered work conveyed by you (or copies made from those copies), or (b) primarily for and in connection with specific products or compilations that contain the covered work, unless you entered into that arrangement, or that patent license was granted, prior to 28 March 2007.  Nothing in this License shall be construed as excluding or limiting any implied license or other defenses to infringement that may otherwise be available to you under applicable patent law.  12. No Surrender of Others' Freedom.  If conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License.  If you cannot convey a covered work so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not convey it at all.  For example, if you agree to terms that obligate you to collect a royalty for further conveying from those to whom you convey the Program, the only way you could satisfy both those terms and this License would be to refrain entirely from conveying the Program.  13. Use with the GNU Affero General Public License.  Notwithstanding any other provision of this License, you have permission to link or combine any covered work with a work licensed under version 3 of the GNU Affero General Public License into a single combined work, and to convey the resulting work.  The terms of this License will continue to apply to the part which is the covered work, but the special requirements of the GNU Affero General Public License, section 13, concerning interaction through a network will apply to the combination as such.  14. Revised Versions of this License.  The Free Software Foundation may publish revised and/or new versions of the GNU General Public License from time to time.  Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.  Each version is given a distinguishing version number.  If the Program specifies that a certain numbered version of the GNU General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that numbered version or of any later version published by the Free Software Foundation.  If the Program does not specify a version number of the GNU General Public License, you may choose any version ever published by the Free Software Foundation.  If the Program specifies that a proxy can decide which future versions of the GNU General Public License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Program.  Later license versions may give you additional or different permissions.  However, no additional obligations are imposed on any author or copyright holder as a result of your choosing to follow a later version.  15. Disclaimer of Warranty.  THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.  16. Limitation of Liability.  IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.  17. Interpretation of Sections 15 and 16.  If the disclaimer of warranty and limitation of liability provided above cannot be given local legal effect according to their terms, reviewing courts shall apply local law that most closely approximates an absolute waiver of all civil liability in connection with the Program, unless a warranty or assumption of liability accompanies a copy of the Program in return for a fee.  END OF TERMS AND CONDITIONS  How to Apply These Terms to Your New Programs  If you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.  To do so, attach the following notices to the program.  It is safest to attach them to the start of each source file to most effectively state the exclusion of warranty; and each file should have at least the \"copyright\" line and a pointer to where the full notice is found.  <one line to give the program's name and a brief idea of what it does.> Copyright (C) <year>  <name of author>  This program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.  This program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License for more details.  You should have received a copy of the GNU General Public License along with this program.  If not, see <http://www.gnu.org/licenses/>.  Also add information on how to contact you by electronic and paper mail.  If the program does terminal interaction, make it output a short notice like this when it starts in an interactive mode:  <program>  Copyright (C) <year>  <name of author> This program comes with ABSOLUTELY NO WARRANTY; for details type `show w'. This is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.  The hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License.  Of course, your program's commands might be different; for a GUI interface, you would use an \"about box\".  You should also get your employer (if you work as a programmer) or school, if any, to sign a \"copyright disclaimer\" for the program, if necessary. For more information on this, and how to apply and follow the GNU GPL, see <http://www.gnu.org/licenses/>.  The GNU General Public License does not permit incorporating your program into proprietary programs.  If your program is a subroutine library, you may consider it more useful to permit linking proprietary applications with the library.  If this is what you want to do, use the GNU Lesser General Public License instead of this License.  But first, please read <http://www.gnu.org/philosophy/why-not-lgpl.html>.   ------------------------------------------------------------------------   GNU Free Documentation License Version 1.3, 3 November 2008   Copyright (C) 2000, 2001, 2002, 2007, 2008 Free Software Foundation, Inc. <http://fsf.org/> Everyone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.  0. PREAMBLE  The purpose of this License is to make a manual, textbook, or other functional and useful document \"free\" in the sense of freedom: to assure everyone the effective freedom to copy and redistribute it, with or without modifying it, either commercially or noncommercially. Secondarily, this License preserves for the author and publisher a way to get credit for their work, while not being considered responsible for modifications made by others.  This License is a kind of \"copyleft\", which means that derivative works of the document must themselves be free in the same sense.  It complements the GNU General Public License, which is a copyleft license designed for free software.  We have designed this License in order to use it for manuals for free software, because free software needs free documentation: a free program should come with manuals providing the same freedoms that the software does.  But this License is not limited to software manuals; it can be used for any textual work, regardless of subject matter or whether it is published as a printed book.  We recommend this License principally for works whose purpose is instruction or reference.   1. APPLICABILITY AND DEFINITIONS  This License applies to any manual or other work, in any medium, that contains a notice placed by the copyright holder saying it can be distributed under the terms of this License.  Such a notice grants a world-wide, royalty-free license, unlimited in duration, to use that work under the conditions stated herein.  The \"Document\", below, refers to any such manual or work.  Any member of the public is a licensee, and is addressed as \"you\".  You accept the license if you copy, modify or distribute the work in a way requiring permission under copyright law.  A \"Modified Version\" of the Document means any work containing the Document or a portion of it, either copied verbatim, or with modifications and/or translated into another language.  A \"Secondary Section\" is a named appendix or a front-matter section of the Document that deals exclusively with the relationship of the publishers or authors of the Document to the Document's overall subject (or to related matters) and contains nothing that could fall directly within that overall subject.  (Thus, if the Document is in part a textbook of mathematics, a Secondary Section may not explain any mathematics.)  The relationship could be a matter of historical connection with the subject or with related matters, or of legal, commercial, philosophical, ethical or political position regarding them.  The \"Invariant Sections\" are certain Secondary Sections whose titles are designated, as being those of Invariant Sections, in the notice that says that the Document is released under this License.  If a section does not fit the above definition of Secondary then it is not allowed to be designated as Invariant.  The Document may contain zero Invariant Sections.  If the Document does not identify any Invariant Sections then there are none.  The \"Cover Texts\" are certain short passages of text that are listed, as Front-Cover Texts or Back-Cover Texts, in the notice that says that the Document is released under this License.  A Front-Cover Text may be at most 5 words, and a Back-Cover Text may be at most 25 words.  A \"Transparent\" copy of the Document means a machine-readable copy, represented in a format whose specification is available to the general public, that is suitable for revising the document straightforwardly with generic text editors or (for images composed of pixels) generic paint programs or (for drawings) some widely available drawing editor, and that is suitable for input to text formatters or for automatic translation to a variety of formats suitable for input to text formatters.  A copy made in an otherwise Transparent file format whose markup, or absence of markup, has been arranged to thwart or discourage subsequent modification by readers is not Transparent. An image format is not Transparent if used for any substantial amount of text.  A copy that is not \"Transparent\" is called \"Opaque\".  Examples of suitable formats for Transparent copies include plain ASCII without markup, Texinfo input format, LaTeX input format, SGML or XML using a publicly available DTD, and standard-conforming simple HTML, PostScript or PDF designed for human modification.  Examples of transparent image formats include PNG, XCF and JPG.  Opaque formats include proprietary formats that can be read and edited only by proprietary word processors, SGML or XML for which the DTD and/or processing tools are not generally available, and the machine-generated HTML, PostScript or PDF produced by some word processors for output purposes only.  The \"Title Page\" means, for a printed book, the title page itself, plus such following pages as are needed to hold, legibly, the material this License requires to appear in the title page.  For works in formats which do not have any title page as such, \"Title Page\" means the text near the most prominent appearance of the work's title, preceding the beginning of the body of the text.  The \"publisher\" means any person or entity that distributes copies of the Document to the public.  A section \"Entitled XYZ\" means a named subunit of the Document whose title either is precisely XYZ or contains XYZ in parentheses following text that translates XYZ in another language.  (Here XYZ stands for a specific section name mentioned below, such as \"Acknowledgements\", \"Dedications\", \"Endorsements\", or \"History\".)  To \"Preserve the Title\" of such a section when you modify the Document means that it remains a section \"Entitled XYZ\" according to this definition.  The Document may include Warranty Disclaimers next to the notice which states that this License applies to the Document.  These Warranty Disclaimers are considered to be included by reference in this License, but only as regards disclaiming warranties: any other implication that these Warranty Disclaimers may have is void and has no effect on the meaning of this License.  2. VERBATIM COPYING  You may copy and distribute the Document in any medium, either commercially or noncommercially, provided that this License, the copyright notices, and the license notice saying this License applies to the Document are reproduced in all copies, and that you add no other conditions whatsoever to those of this License.  You may not use technical measures to obstruct or control the reading or further copying of the copies you make or distribute.  However, you may accept compensation in exchange for copies.  If you distribute a large enough number of copies you must also follow the conditions in section 3.  You may also lend copies, under the same conditions stated above, and you may publicly display copies.   3. COPYING IN QUANTITY  If you publish printed copies (or copies in media that commonly have printed covers) of the Document, numbering more than 100, and the Document's license notice requires Cover Texts, you must enclose the copies in covers that carry, clearly and legibly, all these Cover Texts: Front-Cover Texts on the front cover, and Back-Cover Texts on the back cover.  Both covers must also clearly and legibly identify you as the publisher of these copies.  The front cover must present the full title with all words of the title equally prominent and visible.  You may add other material on the covers in addition. Copying with changes limited to the covers, as long as they preserve the title of the Document and satisfy these conditions, can be treated as verbatim copying in other respects.  If the required texts for either cover are too voluminous to fit legibly, you should put the first ones listed (as many as fit reasonably) on the actual cover, and continue the rest onto adjacent pages.  If you publish or distribute Opaque copies of the Document numbering more than 100, you must either include a machine-readable Transparent copy along with each Opaque copy, or state in or with each Opaque copy a computer-network location from which the general network-using public has access to download using public-standard network protocols a complete Transparent copy of the Document, free of added material. If you use the latter option, you must take reasonably prudent steps, when you begin distribution of Opaque copies in quantity, to ensure that this Transparent copy will remain thus accessible at the stated location until at least one year after the last time you distribute an Opaque copy (directly or through your agents or retailers) of that edition to the public.  It is requested, but not required, that you contact the authors of the Document well before redistributing any large number of copies, to give them a chance to provide you with an updated version of the Document.   4. MODIFICATIONS  You may copy and distribute a Modified Version of the Document under the conditions of sections 2 and 3 above, provided that you release the Modified Version under precisely this License, with the Modified Version filling the role of the Document, thus licensing distribution and modification of the Modified Version to whoever possesses a copy of it.  In addition, you must do these things in the Modified Version:  A. Use in the Title Page (and on the covers, if any) a title distinct from that of the Document, and from those of previous versions (which should, if there were any, be listed in the History section of the Document).  You may use the same title as a previous version if the original publisher of that version gives permission. B. List on the Title Page, as authors, one or more persons or entities responsible for authorship of the modifications in the Modified Version, together with at least five of the principal authors of the Document (all of its principal authors, if it has fewer than five), unless they release you from this requirement. C. State on the Title page the name of the publisher of the Modified Version, as the publisher. D. Preserve all the copyright notices of the Document. E. Add an appropriate copyright notice for your modifications adjacent to the other copyright notices. F. Include, immediately after the copyright notices, a license notice giving the public permission to use the Modified Version under the terms of this License, in the form shown in the Addendum below. G. Preserve in that license notice the full lists of Invariant Sections and required Cover Texts given in the Document's license notice. H. Include an unaltered copy of this License. I. Preserve the section Entitled \"History\", Preserve its Title, and add to it an item stating at least the title, year, new authors, and publisher of the Modified Version as given on the Title Page.  If there is no section Entitled \"History\" in the Document, create one stating the title, year, authors, and publisher of the Document as given on its Title Page, then add an item describing the Modified Version as stated in the previous sentence. J. Preserve the network location, if any, given in the Document for public access to a Transparent copy of the Document, and likewise the network locations given in the Document for previous versions it was based on.  These may be placed in the \"History\" section. You may omit a network location for a work that was published at least four years before the Document itself, or if the original publisher of the version it refers to gives permission. K. For any section Entitled \"Acknowledgements\" or \"Dedications\", Preserve the Title of the section, and preserve in the section all the substance and tone of each of the contributor acknowledgements and/or dedications given therein. L. Preserve all the Invariant Sections of the Document, unaltered in their text and in their titles.  Section numbers or the equivalent are not considered part of the section titles. M. Delete any section Entitled \"Endorsements\".  Such a section may not be included in the Modified Version. N. Do not retitle any existing section to be Entitled \"Endorsements\" or to conflict in title with any Invariant Section. O. Preserve any Warranty Disclaimers.  If the Modified Version includes new front-matter sections or appendices that qualify as Secondary Sections and contain no material copied from the Document, you may at your option designate some or all of these sections as invariant.  To do this, add their titles to the list of Invariant Sections in the Modified Version's license notice. These titles must be distinct from any other section titles.  You may add a section Entitled \"Endorsements\", provided it contains nothing but endorsements of your Modified Version by various parties--for example, statements of peer review or that the text has been approved by an organization as the authoritative definition of a standard.  You may add a passage of up to five words as a Front-Cover Text, and a passage of up to 25 words as a Back-Cover Text, to the end of the list of Cover Texts in the Modified Version.  Only one passage of Front-Cover Text and one of Back-Cover Text may be added by (or through arrangements made by) any one entity.  If the Document already includes a cover text for the same cover, previously added by you or by arrangement made by the same entity you are acting on behalf of, you may not add another; but you may replace the old one, on explicit permission from the previous publisher that added the old one.  The author(s) and publisher(s) of the Document do not by this License give permission to use their names for publicity for or to assert or imply endorsement of any Modified Version.   5. COMBINING DOCUMENTS  You may combine the Document with other documents released under this License, under the terms defined in section 4 above for modified versions, provided that you include in the combination all of the Invariant Sections of all of the original documents, unmodified, and list them all as Invariant Sections of your combined work in its license notice, and that you preserve all their Warranty Disclaimers.  The combined work need only contain one copy of this License, and multiple identical Invariant Sections may be replaced with a single copy.  If there are multiple Invariant Sections with the same name but different contents, make the title of each such section unique by adding at the end of it, in parentheses, the name of the original author or publisher of that section if known, or else a unique number. Make the same adjustment to the section titles in the list of Invariant Sections in the license notice of the combined work.  In the combination, you must combine any sections Entitled \"History\" in the various original documents, forming one section Entitled \"History\"; likewise combine any sections Entitled \"Acknowledgements\", and any sections Entitled \"Dedications\".  You must delete all sections Entitled \"Endorsements\".   6. COLLECTIONS OF DOCUMENTS  You may make a collection consisting of the Document and other documents released under this License, and replace the individual copies of this License in the various documents with a single copy that is included in the collection, provided that you follow the rules of this License for verbatim copying of each of the documents in all other respects.  You may extract a single document from such a collection, and distribute it individually under this License, provided you insert a copy of this License into the extracted document, and follow this License in all other respects regarding verbatim copying of that document.   7. AGGREGATION WITH INDEPENDENT WORKS  A compilation of the Document or its derivatives with other separate and independent documents or works, in or on a volume of a storage or distribution medium, is called an \"aggregate\" if the copyright resulting from the compilation is not used to limit the legal rights of the compilation's users beyond what the individual works permit. When the Document is included in an aggregate, this License does not apply to the other works in the aggregate which are not themselves derivative works of the Document.  If the Cover Text requirement of section 3 is applicable to these copies of the Document, then if the Document is less than one half of the entire aggregate, the Document's Cover Texts may be placed on covers that bracket the Document within the aggregate, or the electronic equivalent of covers if the Document is in electronic form. Otherwise they must appear on printed covers that bracket the whole aggregate.   8. TRANSLATION  Translation is considered a kind of modification, so you may distribute translations of the Document under the terms of section 4. Replacing Invariant Sections with translations requires special permission from their copyright holders, but you may include translations of some or all Invariant Sections in addition to the original versions of these Invariant Sections.  You may include a translation of this License, and all the license notices in the Document, and any Warranty Disclaimers, provided that you also include the original English version of this License and the original versions of those notices and disclaimers.  In case of a disagreement between the translation and the original version of this License or a notice or disclaimer, the original version will prevail.  If a section in the Document is Entitled \"Acknowledgements\", \"Dedications\", or \"History\", the requirement (section 4) to Preserve its Title (section 1) will typically require changing the actual title.   9. TERMINATION  You may not copy, modify, sublicense, or distribute the Document except as expressly provided under this License.  Any attempt otherwise to copy, modify, sublicense, or distribute it is void, and will automatically terminate your rights under this License.  However, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.  Moreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice.  Termination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License.  If your rights have been terminated and not permanently reinstated, receipt of a copy of some or all of the same material does not give you any rights to use it.   10. FUTURE REVISIONS OF THIS LICENSE  The Free Software Foundation may publish new, revised versions of the GNU Free Documentation License from time to time.  Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.  See http://www.gnu.org/copyleft/.  Each version of the License is given a distinguishing version number. If the Document specifies that a particular numbered version of this License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that specified version or of any later version that has been published (not as a draft) by the Free Software Foundation.  If the Document does not specify a version number of this License, you may choose any version ever published (not as a draft) by the Free Software Foundation.  If the Document specifies that a proxy can decide which future versions of this License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Document.  11. RELICENSING  \"Massive Multiauthor Collaboration Site\" (or \"MMC Site\") means any World Wide Web server that publishes copyrightable works and also provides prominent facilities for anybody to edit those works.  A public wiki that anybody can edit is an example of such a server.  A \"Massive Multiauthor Collaboration\" (or \"MMC\") contained in the site means any set of copyrightable works thus published on the MMC site.  \"CC-BY-SA\" means the Creative Commons Attribution-Share Alike 3.0 license published by Creative Commons Corporation, a not-for-profit corporation with a principal place of business in San Francisco, California, as well as future copyleft versions of that license published by that same organization.  \"Incorporate\" means to publish or republish a Document, in whole or in part, as part of another Document.  An MMC is \"eligible for relicensing\" if it is licensed under this License, and if all works that were first published under this License somewhere other than this MMC, and subsequently incorporated in whole or in part into the MMC, (1) had no cover texts or invariant sections, and (2) were thus incorporated prior to November 1, 2008.  The operator of an MMC Site may republish an MMC contained in the site under CC-BY-SA on the same site at any time before August 1, 2009, provided the MMC is eligible for relicensing. ","maintainer":null,"maintainer_email":null,"name":"getdist","package_url":"https://pypi.org/project/getdist/","platform":"any","project_url":"https://pypi.org/project/getdist/","project_urls":{"Documentation":"https://getdist.readthedocs.io","Homepage":"https://getdist.readthedocs.io","Licensing":"https://github.com/cmbant/getdist/blob/master/LICENCE.txt","Source":"https://github.com/cmbant/getdist","Tracker":"https://github.com/cmbant/getdist/issues"},"provides_extra":["gui","docs"],"release_url":"https://pypi.org/project/getdist/1.5.1/","requires_dist":["numpy>=1.17.0","matplotlib!=3.5.0,>=2.2.0","scipy>=1.5","PyYAML>=5.1","packaging","PySide6>=6.1; extra == \"gui\"","sphinx; extra == \"docs\"","sphinx_rtd_theme>=1.0; extra == \"docs\"","sphinxcontrib-jquery; extra == \"docs\""],"requires_python":">=3.7.0","summary":"GetDist Monte Carlo sample analysis, plotting and GUI","version":"1.5.1","yanked":false,"yanked_reason":null},"last_serial":23712224,"releases":{"0.2.0":[{"comment_text":"","digests":{"blake2b_256":"ebf61bde1d53f1c61c4e312718b6f7a273673e8f04d204294690876fb8d477ac","md5":"4022cc5511c69dd25ead61fde2c204f0","sha256":"fff03b29860a4ede215d09091371a197555112d2c435800547ab02f8b87bd9f1"},"downloads":-1,"filename":"GetDist-0.2.0.zip","has_sig":false,"md5_digest":"4022cc5511c69dd25ead61fde2c204f0","packagetype":"sdist","python_version":"source","requires_python":null,"size":129020,"upload_time":"2015-05-22T16:44:18","upload_time_iso_8601":"2015-05-22T16:44:18.999538Z","url":"https://files.pythonhosted.org/packages/eb/f6/1bde1d53f1c61c4e312718b6f7a273673e8f04d204294690876fb8d477ac/GetDist-0.2.0.zip","yanked":false,"yanked_reason":null}],"0.2.1":[{"comment_text":"","digests":{"blake2b_256":"38ca7d957f3c559abe261b3863674f0494fdb8639d01a0b027a90ab3583070f6","md5":"ec16d873f2d558595ed48e9641b314c6","sha256":"3926472c86895346f337faf6c94c575a99601254e32da02c97da6a87033ccdcb"},"downloads":-1,"filename":"GetDist-0.2.1.zip","has_sig":false,"md5_digest":"ec16d873f2d558595ed48e9641b314c6","packagetype":"sdist","python_version":"source","requires_python":null,"size":132446,"upload_time":"2015-06-01T15:25:52","upload_time_iso_8601":"2015-06-01T15:25:52.660407Z","url":"https://files.pythonhosted.org/packages/38/ca/7d957f3c559abe261b3863674f0494fdb8639d01a0b027a90ab3583070f6/GetDist-0.2.1.zip","yanked":false,"yanked_reason":null}],"0.2.2":[{"comment_text":"","digests":{"blake2b_256":"a9663ebb0f6564783fc82e7d6f47e31d3a0dd57ac77c13b4b4a27ddb23fa3412","md5":"c3c0071a2d82e4f314e391804a2b8d45","sha256":"2a84c045d452da7c8bf32401f349c4bb885a9d0a8c98363f3d58f2d4bc425080"},"downloads":-1,"filename":"GetDist-0.2.2.zip","has_sig":false,"md5_digest":"c3c0071a2d82e4f314e391804a2b8d45","packagetype":"sdist","python_version":"source","requires_python":null,"size":133240,"upload_time":"2015-06-04T09:51:57","upload_time_iso_8601":"2015-06-04T09:51:57.986079Z","url":"https://files.pythonhosted.org/packages/a9/66/3ebb0f6564783fc82e7d6f47e31d3a0dd57ac77c13b4b4a27ddb23fa3412/GetDist-0.2.2.zip","yanked":false,"yanked_reason":null}],"0.2.3":[{"comment_text":"","digests":{"blake2b_256":"c731219e0c251547053dc5fbd87ed2265e8a4dffc04fdf6572e554e62cf6c79c","md5":"fab175a36e57a6bb0ba9ca086d88a2fe","sha256":"0fd71d63c7248c93b3ec9c5d5ac166bc00a418d36e1d3ca28128dbe182d61ec8"},"downloads":-1,"filename":"GetDist-0.2.3.zip","has_sig":false,"md5_digest":"fab175a36e57a6bb0ba9ca086d88a2fe","packagetype":"sdist","python_version":"source","requires_python":null,"size":134281,"upload_time":"2015-06-09T14:28:48","upload_time_iso_8601":"2015-06-09T14:28:48.825859Z","url":"https://files.pythonhosted.org/packages/c7/31/219e0c251547053dc5fbd87ed2265e8a4dffc04fdf6572e554e62cf6c79c/GetDist-0.2.3.zip","yanked":false,"yanked_reason":null}],"0.2.4":[{"comment_text":"","digests":{"blake2b_256":"74ba6f73b7452f348fdcc43e7ff0889f5d6d8419e0aec5c7398f9af9b048f3bb","md5":"49a52af1d32b2959a067fc9f33e357a4","sha256":"63cc4fa3513899ac09a9d73407853c07efd5f9d2be62bde7e550447bf110e58c"},"downloads":-1,"filename":"GetDist-0.2.4.zip","has_sig":false,"md5_digest":"49a52af1d32b2959a067fc9f33e357a4","packagetype":"sdist","python_version":"source","requires_python":null,"size":158839,"upload_time":"2015-07-06T09:46:09","upload_time_iso_8601":"2015-07-06T09:46:09.546136Z","url":"https://files.pythonhosted.org/packages/74/ba/6f73b7452f348fdcc43e7ff0889f5d6d8419e0aec5c7398f9af9b048f3bb/GetDist-0.2.4.zip","yanked":false,"yanked_reason":null}],"0.2.5":[{"comment_text":"","digests":{"blake2b_256":"37eae170a851e13ac0874cfa44ff619e53cfd52e1e8743cae785030bbf50934c","md5":"b4f534fce7ed06bdde49adad9c1b02d4","sha256":"b05517193f9d9ba9cb655509f29e9468f920d825920a816da17860bf45099c72"},"downloads":-1,"filename":"GetDist-0.2.5.zip","has_sig":false,"md5_digest":"b4f534fce7ed06bdde49adad9c1b02d4","packagetype":"sdist","python_version":"source","requires_python":null,"size":158922,"upload_time":"2015-07-27T15:05:09","upload_time_iso_8601":"2015-07-27T15:05:09.910561Z","url":"https://files.pythonhosted.org/packages/37/ea/e170a851e13ac0874cfa44ff619e53cfd52e1e8743cae785030bbf50934c/GetDist-0.2.5.zip","yanked":false,"yanked_reason":null}],"0.2.6":[{"comment_text":"","digests":{"blake2b_256":"f9279a56ac3b5b6120015667aaeee042bb420e39eeecccf5570f3c6eb1efec03","md5":"6d5ec8aa2536a1bc8322a2a3f74f2a3b","sha256":"5772b009fffab0a1e30dad25fa3c7da804f64ce26f659358390b2b5a85c4364f"},"downloads":-1,"filename":"GetDist-0.2.6.zip","has_sig":false,"md5_digest":"6d5ec8aa2536a1bc8322a2a3f74f2a3b","packagetype":"sdist","python_version":"source","requires_python":null,"size":161781,"upload_time":"2016-11-08T09:47:58","upload_time_iso_8601":"2016-11-08T09:47:58.038808Z","url":"https://files.pythonhosted.org/packages/f9/27/9a56ac3b5b6120015667aaeee042bb420e39eeecccf5570f3c6eb1efec03/GetDist-0.2.6.zip","yanked":false,"yanked_reason":null}],"0.2.7":[{"comment_text":"","digests":{"blake2b_256":"7e38b23a6427795d86f3f3c2a9a3e8eaa730bfd0c8e70563550e650c7638aed0","md5":"41f9cb7f9f117772b066f7b58208db68","sha256":"9912513e306ba9fd28f1b65902174243e4a96fdcf6fac930b8de4d3515d518bb"},"downloads":-1,"filename":"GetDist-0.2.7.zip","has_sig":false,"md5_digest":"41f9cb7f9f117772b066f7b58208db68","packagetype":"sdist","python_version":"source","requires_python":null,"size":161872,"upload_time":"2017-03-02T10:26:32","upload_time_iso_8601":"2017-03-02T10:26:32.678599Z","url":"https://files.pythonhosted.org/packages/7e/38/b23a6427795d86f3f3c2a9a3e8eaa730bfd0c8e70563550e650c7638aed0/GetDist-0.2.7.zip","yanked":false,"yanked_reason":null}],"0.2.8":[{"comment_text":"","digests":{"blake2b_256":"e94d1cf56765350a847c707776191cf2dbad05207cc8441b0227344ec1412c66","md5":"26ac6d3dc16f90844a87a7b204365c89","sha256":"a44e305ca43440cb6413a32cd7bab3b5e344541a2c4147eb79b9195fa717d83c"},"downloads":-1,"filename":"GetDist-0.2.8.tar.gz","has_sig":false,"md5_digest":"26ac6d3dc16f90844a87a7b204365c89","packagetype":"sdist","python_version":"source","requires_python":null,"size":154882,"upload_time":"2017-09-27T13:54:17","upload_time_iso_8601":"2017-09-27T13:54:17.672771Z","url":"https://files.pythonhosted.org/packages/e9/4d/1cf56765350a847c707776191cf2dbad05207cc8441b0227344ec1412c66/GetDist-0.2.8.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.1":[{"comment_text":"","digests":{"blake2b_256":"12495d775ce226744aea30a1ae25f4d48864a5ec5de05c9392fa188128b7c3e7","md5":"f8704558ac05d12a1583caaad9e5a007","sha256":"e122527b1da2ead3e9a9c6d10b25fe8db932bfe9f48a92068f10538354805448"},"downloads":-1,"filename":"GetDist-0.2.8.1.tar.gz","has_sig":false,"md5_digest":"f8704558ac05d12a1583caaad9e5a007","packagetype":"sdist","python_version":"source","requires_python":null,"size":159197,"upload_time":"2017-09-27T14:01:09","upload_time_iso_8601":"2017-09-27T14:01:09.639818Z","url":"https://files.pythonhosted.org/packages/12/49/5d775ce226744aea30a1ae25f4d48864a5ec5de05c9392fa188128b7c3e7/GetDist-0.2.8.1.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.2":[{"comment_text":"","digests":{"blake2b_256":"f2e0972f12bd9261dafb632815b71aaa53718a04ee7934ac9a65240aabab0e68","md5":"782c3d234a352b163cf0f1588b633969","sha256":"a88b5a4252fd8abca4bae2927b6299255d409ef7b48ed669db82264ac9c009a2"},"downloads":-1,"filename":"GetDist-0.2.8.2.tar.gz","has_sig":false,"md5_digest":"782c3d234a352b163cf0f1588b633969","packagetype":"sdist","python_version":"source","requires_python":null,"size":159211,"upload_time":"2017-11-20T10:20:48","upload_time_iso_8601":"2017-11-20T10:20:48.926798Z","url":"https://files.pythonhosted.org/packages/f2/e0/972f12bd9261dafb632815b71aaa53718a04ee7934ac9a65240aabab0e68/GetDist-0.2.8.2.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.3":[{"comment_text":"","digests":{"blake2b_256":"7b4d2fa5b555341c3d63e89298476aa04194c76b7d24c9096081972563a1f89c","md5":"b5ed8e0005a5630d47d7a1d715117d9d","sha256":"73da9dae4538c336dfbd2ce47c40cccbeaf6f0872d340fff850a5f9baac31e99"},"downloads":-1,"filename":"GetDist-0.2.8.3.tar.gz","has_sig":false,"md5_digest":"b5ed8e0005a5630d47d7a1d715117d9d","packagetype":"sdist","python_version":"source","requires_python":null,"size":160432,"upload_time":"2017-12-05T10:49:03","upload_time_iso_8601":"2017-12-05T10:49:03.736583Z","url":"https://files.pythonhosted.org/packages/7b/4d/2fa5b555341c3d63e89298476aa04194c76b7d24c9096081972563a1f89c/GetDist-0.2.8.3.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.4":[{"comment_text":"","digests":{"blake2b_256":"bf6168bde7958a853fe40fc3e49c8d62ac69c4c381871d6ad4230c602a7d4d75","md5":"f0e5e4c17c050cdbfa116f4cd34de223","sha256":"518b6f428966febe3b8106890af8d26172ff5c83408aa642a2e1365a5baf24d8"},"downloads":-1,"filename":"GetDist-0.2.8.4.tar.gz","has_sig":false,"md5_digest":"f0e5e4c17c050cdbfa116f4cd34de223","packagetype":"sdist","python_version":"source","requires_python":null,"size":163808,"upload_time":"2017-12-20T08:59:35","upload_time_iso_8601":"2017-12-20T08:59:35.078579Z","url":"https://files.pythonhosted.org/packages/bf/61/68bde7958a853fe40fc3e49c8d62ac69c4c381871d6ad4230c602a7d4d75/GetDist-0.2.8.4.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.4.1":[{"comment_text":"","digests":{"blake2b_256":"81f3c30fc8c627e2aab21dedb03f7797fee45bc4b35aef9b196738a256a9c60a","md5":"f2eb662266d091f2845ce5c9b0391115","sha256":"60506c432a5d67e318c99b95e4ee90ef64edca035e67dcd501d54b235e1ef879"},"downloads":-1,"filename":"GetDist-0.2.8.4.1.tar.gz","has_sig":false,"md5_digest":"f2eb662266d091f2845ce5c9b0391115","packagetype":"sdist","python_version":"source","requires_python":null,"size":163882,"upload_time":"2017-12-20T09:15:56","upload_time_iso_8601":"2017-12-20T09:15:56.320285Z","url":"https://files.pythonhosted.org/packages/81/f3/c30fc8c627e2aab21dedb03f7797fee45bc4b35aef9b196738a256a9c60a/GetDist-0.2.8.4.1.tar.gz","yanked":false,"yanked_reason":null}],"0.2.8.4.2":[{"comment_text":"","digests":{"blake2b_256":"54dda547224b4886e71eb086d0901fb59db92bf0afe5d09c55008040241d96d6","md5":"f8509c974bd856dd54e8b9161068b0d5","sha256":"ae06028f0f496607db165a57c2aac254d0343f51e8fb2c78240b40bcd1bc3af3"},"downloads":-1,"filename":"GetDist-0.2.8.4.2.tar.gz","has_sig":false,"md5_digest":"f8509c974bd856dd54e8b9161068b0d5","packagetype":"sdist","python_version":"source","requires_python":null,"size":163721,"upload_time":"2017-12-20T09:58:22","upload_time_iso_8601":"2017-12-20T09:58:22.428932Z","url":"https://files.pythonhosted.org/packages/54/dd/a547224b4886e71eb086d0901fb59db92bf0afe5d09c55008040241d96d6/GetDist-0.2.8.4.2.tar.gz","yanked":false,"yanked_reason":null}],"0.3.0":[{"comment_text":"","digests":{"blake2b_256":"088408480c81cd4d4baf64ef04d32cd8be90eab044bc45e183f8232f854b0d6b","md5":"9b97e4221a4bf94b510cedc256320ec8","sha256":"b7d7a7829f6c6347d13673b1e55d06725058cca407eac85d234802e1480f9ef4"},"downloads":-1,"filename":"GetDist-0.3.0.tar.gz","has_sig":false,"md5_digest":"9b97e4221a4bf94b510cedc256320ec8","packagetype":"sdist","python_version":"source","requires_python":null,"size":170341,"upload_time":"2018-09-13T10:57:30","upload_time_iso_8601":"2018-09-13T10:57:30.193082Z","url":"https://files.pythonhosted.org/packages/08/84/08480c81cd4d4baf64ef04d32cd8be90eab044bc45e183f8232f854b0d6b/GetDist-0.3.0.tar.gz","yanked":false,"yanked_reason":null}],"0.3.1":[{"comment_text":"","digests":{"blake2b_256":"e129006697a61a548d1ef73edccb4562740549ac004e8321cc26c4d3b9e11375","md5":"bd8408d283339238efc9f823839e5dae","sha256":"6c0654e4fe5c157e833087cda59e1e202d8c6e74f152b06909038537e65d223c"},"downloads":-1,"filename":"GetDist-0.3.1.tar.gz","has_sig":false,"md5_digest":"bd8408d283339238efc9f823839e5dae","packagetype":"sdist","python_version":"source","requires_python":null,"size":233810,"upload_time":"2019-01-21T17:37:29","upload_time_iso_8601":"2019-01-21T17:37:29.478144Z","url":"https://files.pythonhosted.org/packages/e1/29/006697a61a548d1ef73edccb4562740549ac004e8321cc26c4d3b9e11375/GetDist-0.3.1.tar.gz","yanked":false,"yanked_reason":null}],"0.3.2":[{"comment_text":"","digests":{"blake2b_256":"c89206742f83358c3d26b3ba7a5ba9df72f7dbccaa07beb51c9539f484a53cde","md5":"46c433c4c0469c2a7ab48353541ce9fc","sha256":"bb4d49ed4080f0f00833156b829c0d8a4840bfbd4978dcd13f30c1665df11847"},"downloads":-1,"filename":"GetDist-0.3.2.tar.gz","has_sig":false,"md5_digest":"46c433c4c0469c2a7ab48353541ce9fc","packagetype":"sdist","python_version":"source","requires_python":null,"size":231785,"upload_time":"2019-02-08T14:30:57","upload_time_iso_8601":"2019-02-08T14:30:57.066956Z","url":"https://files.pythonhosted.org/packages/c8/92/06742f83358c3d26b3ba7a5ba9df72f7dbccaa07beb51c9539f484a53cde/GetDist-0.3.2.tar.gz","yanked":false,"yanked_reason":null}],"0.3.3":[{"comment_text":"","digests":{"blake2b_256":"48d431181dc2bd5cac570134db67cd53b19f6a7c033277391954848d6f90e079","md5":"67100eb043313723ddcc132917049539","sha256":"45f621cbe6f5ef12cfe3f977d5c8e7899260cd46d2e3bd4ea6a44babfba54dff"},"downloads":-1,"filename":"GetDist-0.3.3.tar.gz","has_sig":false,"md5_digest":"67100eb043313723ddcc132917049539","packagetype":"sdist","python_version":"source","requires_python":null,"size":233243,"upload_time":"2019-07-15T15:49:01","upload_time_iso_8601":"2019-07-15T15:49:01.080064Z","url":"https://files.pythonhosted.org/packages/48/d4/31181dc2bd5cac570134db67cd53b19f6a7c033277391954848d6f90e079/GetDist-0.3.3.tar.gz","yanked":false,"yanked_reason":null}],"1.0.0":[{"comment_text":"","digests":{"blake2b_256":"bf5d5411880577687b8ee477374544e0a699f2b2649e5454cafba46aed848204","md5":"bc9b72b7f04c3d486bee1c9a261ffe95","sha256":"e23505c423dc7b2c948643f48817d8405c3fcf4ff39f987f8a27ba77b5c97afd"},"downloads":-1,"filename":"GetDist-1.0.0.tar.gz","has_sig":false,"md5_digest":"bc9b72b7f04c3d486bee1c9a261ffe95","packagetype":"sdist","python_version":"source","requires_python":null,"size":755538,"upload_time":"2019-10-29T18:44:48","upload_time_iso_8601":"2019-10-29T18:44:48.812093Z","url":"https://files.pythonhosted.org/packages/bf/5d/5411880577687b8ee477374544e0a699f2b2649e5454cafba46aed848204/GetDist-1.0.0.tar.gz","yanked":false,"yanked_reason":null}],"1.0.1":[{"comment_text":"","digests":{"blake2b_256":"381236e8c73ac620a7e569bc447c7dfde41660a6d3ea8e52fb6f6623710d0086","md5":"0cd55119a9d79c2da59ca2cbaf6451ee","sha256":"fe8781ad21f868dce3961e353d913cce71fcb65ec15d3bf7dc5a780f870639ef"},"downloads":-1,"filename":"GetDist-1.0.1.tar.gz","has_sig":false,"md5_digest":"0cd55119a9d79c2da59ca2cbaf6451ee","packagetype":"sdist","python_version":"source","requires_python":">=2.7,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*,!=3.4.*,!=3.5.*","size":753159,"upload_time":"2019-11-04T11:08:50","upload_time_iso_8601":"2019-11-04T11:08:50.858785Z","url":"https://files.pythonhosted.org/packages/38/12/36e8c73ac620a7e569bc447c7dfde41660a6d3ea8e52fb6f6623710d0086/GetDist-1.0.1.tar.gz","yanked":false,"yanked_reason":null}],"1.0.2":[{"comment_text":"","digests":{"blake2b_256":"1fd9de4af0383d9ce9b312b4a5ede249271f00336abfe797a6a0a74e5de148de","md5":"6d1607e72a58f70fd35076df98a8a192","sha256":"3017f9a10b9bdc4f12b311a46822aa7f4191bb6d37ee6d540fbbfceb664ef636"},"downloads":-1,"filename":"GetDist-1.0.2.tar.gz","has_sig":false,"md5_digest":"6d1607e72a58f70fd35076df98a8a192","packagetype":"sdist","python_version":"source","requires_python":">=2.7,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*,!=3.4.*,!=3.5.*","size":753247,"upload_time":"2019-11-10T21:50:03","upload_time_iso_8601":"2019-11-10T21:50:03.713545Z","url":"https://files.pythonhosted.org/packages/1f/d9/de4af0383d9ce9b312b4a5ede249271f00336abfe797a6a0a74e5de148de/GetDist-1.0.2.tar.gz","yanked":false,"yanked_reason":null}],"1.0.3":[{"comment_text":"","digests":{"blake2b_256":"cd54565c3ca801170083bb141b1c5d26f2962cb680b6d52514cd5177000b645f","md5":"b85179304a0aefe67fda378a2f7353c9","sha256":"dc483295fd12c0fa1a542b31afb22134433cc5d605d4aa4307d1e3b911601194"},"downloads":-1,"filename":"GetDist-1.0.3.tar.gz","has_sig":false,"md5_digest":"b85179304a0aefe67fda378a2f7353c9","packagetype":"sdist","python_version":"source","requires_python":">=2.7,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*,!=3.4.*,!=3.5.*","size":753311,"upload_time":"2019-11-21T13:21:33","upload_time_iso_8601":"2019-11-21T13:21:33.532865Z","url":"https://files.pythonhosted.org/packages/cd/54/565c3ca801170083bb141b1c5d26f2962cb680b6d52514cd5177000b645f/GetDist-1.0.3.tar.gz","yanked":false,"yanked_reason":null}],"1.0.4":[{"comment_text":"","digests":{"blake2b_256":"25b2eb0b6d82d772c36e5d8f420a17f915b608d7c7516b5ab4efad9ec3d7873f","md5":"0ffe4dfb74a5be86d650e42488af0911","sha256":"f299d01382805488a18419b8791055ed0705674ef4c6574eea1b3e4535d35646"},"downloads":-1,"filename":"GetDist-1.0.4.tar.gz","has_sig":false,"md5_digest":"0ffe4dfb74a5be86d650e42488af0911","packagetype":"sdist","python_version":"source","requires_python":">=2.7,!=3.0.*,!=3.1.*,!=3.2.*,!=3.3.*,!=3.4.*,!=3.5.*","size":743459,"upload_time":"2020-02-11T08:46:49","upload_time_iso_8601":"2020-02-11T08:46:49.501572Z","url":"https://files.pythonhosted.org/packages/25/b2/eb0b6d82d772c36e5d8f420a17f915b608d7c7516b5ab4efad9ec3d7873f/GetDist-1.0.4.tar.gz","yanked":false,"yanked_reason":null}],"1.1.0":[{"comment_text":"","digests":{"blake2b_256":"9940c0150036b77c5f06cf7b6b311f3a90ef1c652c9f5312540407cd2e195aea","md5":"218ede930880e2c3d718dc283380eed3","sha256":"b1172bfa79215d15078b0b88803fff4e36faa334606876e175e6dab1580a78a4"},"downloads":-1,"filename":"GetDist-1.1.0.tar.gz","has_sig":false,"md5_digest":"218ede930880e2c3d718dc283380eed3","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":744076,"upload_time":"2020-02-12T14:22:36","upload_time_iso_8601":"2020-02-12T14:22:36.833355Z","url":"https://files.pythonhosted.org/packages/99/40/c0150036b77c5f06cf7b6b311f3a90ef1c652c9f5312540407cd2e195aea/GetDist-1.1.0.tar.gz","yanked":false,"yanked_reason":null}],"1.1.1":[{"comment_text":"","digests":{"blake2b_256":"087a5172f4eea1b8b2c38d2bd5334bf6a4af883cd5024aa956000b38aa42e4c3","md5":"159d5a20e3b179b34b53ac909c92c944","sha256":"ed2dc899e303f0f5c6f948973d32dba4f2613ad99d533016f0e9c0441af4a299"},"downloads":-1,"filename":"GetDist-1.1.1.tar.gz","has_sig":false,"md5_digest":"159d5a20e3b179b34b53ac909c92c944","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":745527,"upload_time":"2020-04-30T11:17:49","upload_time_iso_8601":"2020-04-30T11:17:49.976478Z","url":"https://files.pythonhosted.org/packages/08/7a/5172f4eea1b8b2c38d2bd5334bf6a4af883cd5024aa956000b38aa42e4c3/GetDist-1.1.1.tar.gz","yanked":false,"yanked_reason":null}],"1.1.2":[{"comment_text":"","digests":{"blake2b_256":"45677a972b42e0e238ab34e43569a51bfb54f9abd05b992af0561cf003df6608","md5":"3597b39844dd8b3083b4a25f78fd5af1","sha256":"2535a76a1b68eddefb3bab5b5e56f3297ccddb0d8a115a852217ad5197596123"},"downloads":-1,"filename":"GetDist-1.1.2.tar.gz","has_sig":false,"md5_digest":"3597b39844dd8b3083b4a25f78fd5af1","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":745662,"upload_time":"2020-05-19T16:25:37","upload_time_iso_8601":"2020-05-19T16:25:37.578211Z","url":"https://files.pythonhosted.org/packages/45/67/7a972b42e0e238ab34e43569a51bfb54f9abd05b992af0561cf003df6608/GetDist-1.1.2.tar.gz","yanked":false,"yanked_reason":null}],"1.1.3":[{"comment_text":"","digests":{"blake2b_256":"586e81301f33959ccbac42e29ce542d32f20a056a89a130cba60b84bd50da180","md5":"35c91b41618d7d26235a9462b88e407c","sha256":"e67ff6f36fd66c5e06d204f9102af5d26dea7f865212b65868af135e522ec046"},"downloads":-1,"filename":"GetDist-1.1.3.tar.gz","has_sig":false,"md5_digest":"35c91b41618d7d26235a9462b88e407c","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":748761,"upload_time":"2021-02-04T20:47:08","upload_time_iso_8601":"2021-02-04T20:47:08.170197Z","url":"https://files.pythonhosted.org/packages/58/6e/81301f33959ccbac42e29ce542d32f20a056a89a130cba60b84bd50da180/GetDist-1.1.3.tar.gz","yanked":false,"yanked_reason":null}],"1.1.4":[{"comment_text":"","digests":{"blake2b_256":"c4cb3a00fdb13d62eb8ae7c6f17a97609858c6cd99b17891a1596d21b6af65f7","md5":"e873f9414c4dd398e95d8b63d8f4c3a6","sha256":"2725df7a2501df9f820f0106554a5491d8d4219daf250e6e0497f6738adf3fe7"},"downloads":-1,"filename":"GetDist-1.1.4.tar.gz","has_sig":false,"md5_digest":"e873f9414c4dd398e95d8b63d8f4c3a6","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":748897,"upload_time":"2021-03-15T15:10:07","upload_time_iso_8601":"2021-03-15T15:10:07.830789Z","url":"https://files.pythonhosted.org/packages/c4/cb/3a00fdb13d62eb8ae7c6f17a97609858c6cd99b17891a1596d21b6af65f7/GetDist-1.1.4.tar.gz","yanked":false,"yanked_reason":null}],"1.2.0":[{"comment_text":"","digests":{"blake2b_256":"5ad88ce3431918631b84ca3461fec6085c169344503f288b474c0f8837368e89","md5":"6f8c54818fcafa57a7b594b37a81fe61","sha256":"6951716fc512bf11050d01f73083694eac57fbf657f3bd54bc00fbbb4970f8f5"},"downloads":-1,"filename":"GetDist-1.2.0.tar.gz","has_sig":false,"md5_digest":"6f8c54818fcafa57a7b594b37a81fe61","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":771033,"upload_time":"2021-04-19T09:18:26","upload_time_iso_8601":"2021-04-19T09:18:26.863150Z","url":"https://files.pythonhosted.org/packages/5a/d8/8ce3431918631b84ca3461fec6085c169344503f288b474c0f8837368e89/GetDist-1.2.0.tar.gz","yanked":false,"yanked_reason":null}],"1.2.1":[{"comment_text":"","digests":{"blake2b_256":"cdd2bc418d7cb1cbf53d9dbb28347310cc270b7147dccc4fc3814b7d4f194e22","md5":"20347e1def32b4e26b8fde0180b3f43d","sha256":"ecaee0b0447e3a0bba8b388f092c743e3f2d16051923fafcd2d0d6f3223a0b74"},"downloads":-1,"filename":"GetDist-1.2.1.tar.gz","has_sig":false,"md5_digest":"20347e1def32b4e26b8fde0180b3f43d","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":771357,"upload_time":"2021-04-26T11:38:26","upload_time_iso_8601":"2021-04-26T11:38:26.057886Z","url":"https://files.pythonhosted.org/packages/cd/d2/bc418d7cb1cbf53d9dbb28347310cc270b7147dccc4fc3814b7d4f194e22/GetDist-1.2.1.tar.gz","yanked":false,"yanked_reason":null}],"1.2.2":[{"comment_text":"","digests":{"blake2b_256":"43d038f0af4822895bd54aa81cfff5049806450ed1a66f71584f2c43caa90b71","md5":"36a3edb06aa3173f881b69348f4bf4f5","sha256":"335b92f854a37a7fd59787381769c15b8062c4ff71ac8ca09aa2cc1e59208812"},"downloads":-1,"filename":"GetDist-1.2.2.tar.gz","has_sig":false,"md5_digest":"36a3edb06aa3173f881b69348f4bf4f5","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":771875,"upload_time":"2021-05-18T16:07:06","upload_time_iso_8601":"2021-05-18T16:07:06.143337Z","url":"https://files.pythonhosted.org/packages/43/d0/38f0af4822895bd54aa81cfff5049806450ed1a66f71584f2c43caa90b71/GetDist-1.2.2.tar.gz","yanked":false,"yanked_reason":null}],"1.2.3":[{"comment_text":"","digests":{"blake2b_256":"54c8a2dae2192eae5c6034c2077e27681aedd3dd63e6591ea81e674eac2a35a3","md5":"6e8537cdeb3dfbbecc48be54e5777d7e","sha256":"92e13a8411181be1137ea0632e2a240c0c05a20559fd87e9a834cf9456bcf623"},"downloads":-1,"filename":"GetDist-1.2.3.tar.gz","has_sig":false,"md5_digest":"6e8537cdeb3dfbbecc48be54e5777d7e","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":772468,"upload_time":"2021-05-27T17:11:00","upload_time_iso_8601":"2021-05-27T17:11:00.664793Z","url":"https://files.pythonhosted.org/packages/54/c8/a2dae2192eae5c6034c2077e27681aedd3dd63e6591ea81e674eac2a35a3/GetDist-1.2.3.tar.gz","yanked":false,"yanked_reason":null}],"1.3.0":[{"comment_text":"","digests":{"blake2b_256":"a929e2b8e23e1f732071e49c08a68857094c01572d6f5982f602cb6ae42d245a","md5":"d3743fbba4382fcbff226814ba0a2161","sha256":"8e8357574932b057ecdab392edfcc4379b58c9f715357eb876f4b45803325cd4"},"downloads":-1,"filename":"GetDist-1.3.0.tar.gz","has_sig":false,"md5_digest":"d3743fbba4382fcbff226814ba0a2161","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":775744,"upload_time":"2021-06-04T17:12:38","upload_time_iso_8601":"2021-06-04T17:12:38.563193Z","url":"https://files.pythonhosted.org/packages/a9/29/e2b8e23e1f732071e49c08a68857094c01572d6f5982f602cb6ae42d245a/GetDist-1.3.0.tar.gz","yanked":false,"yanked_reason":null}],"1.3.1":[{"comment_text":"","digests":{"blake2b_256":"189259e3909c0b1e7b7d913ac64b80b60e0db757853a954c5180484960abc4ea","md5":"e5abadb2849b0e038a17e505940ae479","sha256":"89368f6dece4ee45ccf86509db3a4d11a987e4228db912b6c6f3d50be70c7420"},"downloads":-1,"filename":"GetDist-1.3.1.tar.gz","has_sig":false,"md5_digest":"e5abadb2849b0e038a17e505940ae479","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":776042,"upload_time":"2021-07-20T21:47:15","upload_time_iso_8601":"2021-07-20T21:47:15.794053Z","url":"https://files.pythonhosted.org/packages/18/92/59e3909c0b1e7b7d913ac64b80b60e0db757853a954c5180484960abc4ea/GetDist-1.3.1.tar.gz","yanked":false,"yanked_reason":null}],"1.3.2":[{"comment_text":"","digests":{"blake2b_256":"ae5f78244121dfb0d1e4137597a3c32f9e688ebc9096567af07a3347afb0b20e","md5":"7356bcf3ff0c93adf54931f77baafec7","sha256":"164f33262525c2f65826ee4487674dc93ebd3eb4962e0e898b6aa39d3a84f9f8"},"downloads":-1,"filename":"GetDist-1.3.2.tar.gz","has_sig":false,"md5_digest":"7356bcf3ff0c93adf54931f77baafec7","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":773583,"upload_time":"2021-08-20T08:02:30","upload_time_iso_8601":"2021-08-20T08:02:30.570202Z","url":"https://files.pythonhosted.org/packages/ae/5f/78244121dfb0d1e4137597a3c32f9e688ebc9096567af07a3347afb0b20e/GetDist-1.3.2.tar.gz","yanked":false,"yanked_reason":null}],"1.3.3":[{"comment_text":"","digests":{"blake2b_256":"8e0cdd3d3b68e1f1ad468427d724baf20d1c11c37dab8efd24a2913f81b3de09","md5":"5c5f6fdad6c0f8926553dff188ce068e","sha256":"e61b6ba4a1506f98153de926d768c552ac4425f5753ae10eff1aed52c50e492f"},"downloads":-1,"filename":"GetDist-1.3.3.tar.gz","has_sig":false,"md5_digest":"5c5f6fdad6c0f8926553dff188ce068e","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":777451,"upload_time":"2021-12-08T11:00:25","upload_time_iso_8601":"2021-12-08T11:00:25.343354Z","url":"https://files.pythonhosted.org/packages/8e/0c/dd3d3b68e1f1ad468427d724baf20d1c11c37dab8efd24a2913f81b3de09/GetDist-1.3.3.tar.gz","yanked":false,"yanked_reason":null}],"1.3.4":[{"comment_text":"","digests":{"blake2b_256":"5b51299a1e48cb5f4bc96c0e9706c976b61bf9c4ad55ad386d48a29a05460bb5","md5":"92298bfe786533adafc9a8f9e31d5889","sha256":"bc007b91fb3cbb0947ef4b6558cbb21a20038b31361a43751f70794c1c6e0721"},"downloads":-1,"filename":"GetDist-1.3.4.tar.gz","has_sig":false,"md5_digest":"92298bfe786533adafc9a8f9e31d5889","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":777231,"upload_time":"2022-02-23T11:35:18","upload_time_iso_8601":"2022-02-23T11:35:18.141611Z","url":"https://files.pythonhosted.org/packages/5b/51/299a1e48cb5f4bc96c0e9706c976b61bf9c4ad55ad386d48a29a05460bb5/GetDist-1.3.4.tar.gz","yanked":false,"yanked_reason":null}],"1.4":[{"comment_text":"","digests":{"blake2b_256":"91c0af169b36715b1529214da461110452162bf3a190a5403eed312ed2ee8475","md5":"c0b37e301315657f78afe9f258eaec68","sha256":"2ae8afdac6b61d0d4225f4973a9517b679ceee7561503a6ec220fcc938e6a5fc"},"downloads":-1,"filename":"GetDist-1.4.tar.gz","has_sig":false,"md5_digest":"c0b37e301315657f78afe9f258eaec68","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":777333,"upload_time":"2022-11-16T15:57:18","upload_time_iso_8601":"2022-11-16T15:57:18.581562Z","url":"https://files.pythonhosted.org/packages/91/c0/af169b36715b1529214da461110452162bf3a190a5403eed312ed2ee8475/GetDist-1.4.tar.gz","yanked":false,"yanked_reason":null}],"1.4.1":[{"comment_text":"","digests":{"blake2b_256":"6426d2c41744e85ec24a676757ccc884731ce259f5afdb816534e3a90fc85cd0","md5":"850349ea58aef5f47a4448327ffa18c4","sha256":"fa9a67db6ed1e6311414b3df23b3b1d56e5fcf9e5708225c83e4e746fac464c0"},"downloads":-1,"filename":"GetDist-1.4.1.tar.gz","has_sig":false,"md5_digest":"850349ea58aef5f47a4448327ffa18c4","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":777320,"upload_time":"2023-02-13T17:05:07","upload_time_iso_8601":"2023-02-13T17:05:07.233281Z","url":"https://files.pythonhosted.org/packages/64/26/d2c41744e85ec24a676757ccc884731ce259f5afdb816534e3a90fc85cd0/GetDist-1.4.1.tar.gz","yanked":false,"yanked_reason":null}],"1.4.2":[{"comment_text":"","digests":{"blake2b_256":"d410394eb79f9841e916c3e81cf9ee3a438fd3498418c107ed646a175dc57c29","md5":"712ebc5019363342b7e80700dc1c8e7b","sha256":"74c909a552eccbd9fa39a330a5a08e5b30a4de553bae61f1febe20e0822ed221"},"downloads":-1,"filename":"GetDist-1.4.2.tar.gz","has_sig":false,"md5_digest":"712ebc5019363342b7e80700dc1c8e7b","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":777813,"upload_time":"2023-03-02T13:32:37","upload_time_iso_8601":"2023-03-02T13:32:37.708639Z","url":"https://files.pythonhosted.org/packages/d4/10/394eb79f9841e916c3e81cf9ee3a438fd3498418c107ed646a175dc57c29/GetDist-1.4.2.tar.gz","yanked":false,"yanked_reason":null}],"1.4.3":[{"comment_text":"","digests":{"blake2b_256":"ef0a5b79f97b5c797f324ec0e0b7e242ddc3a656bc8248ad21209d2f895d9041","md5":"14f327d20eb9443344155018357fcb59","sha256":"7432945e2d517c6ba765348eff276c0affb2da2b69397b1a99c743ee57666180"},"downloads":-1,"filename":"GetDist-1.4.3.tar.gz","has_sig":false,"md5_digest":"14f327d20eb9443344155018357fcb59","packagetype":"sdist","python_version":"source","requires_python":">=3.6","size":778148,"upload_time":"2023-03-29T16:22:24","upload_time_iso_8601":"2023-03-29T16:22:24.988064Z","url":"https://files.pythonhosted.org/packages/ef/0a/5b79f97b5c797f324ec0e0b7e242ddc3a656bc8248ad21209d2f895d9041/GetDist-1.4.3.tar.gz","yanked":false,"yanked_reason":null}],"1.4.4":[{"comment_text":"","digests":{"blake2b_256":"30b8691682615f75ab53c892a02c4c4e58d2855e437d8786c0b17fa945c8c14f","md5":"5200692bdad40d0ea7c1bb57e61fa556","sha256":"51b0b9377f99de4e05d43a0e0bf213006903f8eb9582b768b80e908b50b0b6ed"},"downloads":-1,"filename":"getdist-1.4.4.tar.gz","has_sig":false,"md5_digest":"5200692bdad40d0ea7c1bb57e61fa556","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":825761,"upload_time":"2023-10-10T11:01:13","upload_time_iso_8601":"2023-10-10T11:01:13.700160Z","url":"https://files.pythonhosted.org/packages/30/b8/691682615f75ab53c892a02c4c4e58d2855e437d8786c0b17fa945c8c14f/getdist-1.4.4.tar.gz","yanked":false,"yanked_reason":null}],"1.4.5":[{"comment_text":"","digests":{"blake2b_256":"f8ce4d1bf267a879cc83c5f23f6314fde4c9181585024029c9228e735722d409","md5":"099b7188e8339ae707e79e7bc932495d","sha256":"e65ae5019f7ea7b0c8eebfffb06e738a53f3b2242278d8d24925635633044500"},"downloads":-1,"filename":"getdist-1.4.5.tar.gz","has_sig":false,"md5_digest":"099b7188e8339ae707e79e7bc932495d","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":825761,"upload_time":"2023-10-10T11:16:09","upload_time_iso_8601":"2023-10-10T11:16:09.262738Z","url":"https://files.pythonhosted.org/packages/f8/ce/4d1bf267a879cc83c5f23f6314fde4c9181585024029c9228e735722d409/getdist-1.4.5.tar.gz","yanked":false,"yanked_reason":null}],"1.4.6":[{"comment_text":"","digests":{"blake2b_256":"6f0ce3b4118b4851d69c73b79adc8c900c3538d33c5d8a2243ed7e9de70e1e13","md5":"f66b17d67ceb5995f568bb665dec1d94","sha256":"03e26d67a427eeb0ab6adec24fecf9128cf85b0d04f4a50dc6d38998b9b8c64a"},"downloads":-1,"filename":"getdist-1.4.6.tar.gz","has_sig":false,"md5_digest":"f66b17d67ceb5995f568bb665dec1d94","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":825970,"upload_time":"2023-11-10T13:24:42","upload_time_iso_8601":"2023-11-10T13:24:42.492089Z","url":"https://files.pythonhosted.org/packages/6f/0c/e3b4118b4851d69c73b79adc8c900c3538d33c5d8a2243ed7e9de70e1e13/getdist-1.4.6.tar.gz","yanked":false,"yanked_reason":null}],"1.4.7":[{"comment_text":"","digests":{"blake2b_256":"58b621f4d562abf9043743a777046173473d0a3340978a308af348ed1e4211b5","md5":"1e9bd636674c1202c347a9dbd743a765","sha256":"c54c1a2aad2d7111e03775d0e9a2e8446c85e595eb8970ce6df0f1a574cd9031"},"downloads":-1,"filename":"getdist-1.4.7.tar.gz","has_sig":false,"md5_digest":"1e9bd636674c1202c347a9dbd743a765","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826060,"upload_time":"2024-01-19T09:28:40","upload_time_iso_8601":"2024-01-19T09:28:40.718737Z","url":"https://files.pythonhosted.org/packages/58/b6/21f4d562abf9043743a777046173473d0a3340978a308af348ed1e4211b5/getdist-1.4.7.tar.gz","yanked":false,"yanked_reason":null}],"1.4.8":[{"comment_text":"","digests":{"blake2b_256":"3898e718040983364bc6713df59c0f3ab6679f37cb37988fd5baa79b72157a3b","md5":"cda4d0a0f961b1df3386ed39b35c710f","sha256":"8faec10646307182d16b5a58b846b64b48431ff0922228c84e4cf06ff114e9e7"},"downloads":-1,"filename":"getdist-1.4.8.tar.gz","has_sig":false,"md5_digest":"cda4d0a0f961b1df3386ed39b35c710f","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826041,"upload_time":"2024-04-13T08:26:48","upload_time_iso_8601":"2024-04-13T08:26:48.226710Z","url":"https://files.pythonhosted.org/packages/38/98/e718040983364bc6713df59c0f3ab6679f37cb37988fd5baa79b72157a3b/getdist-1.4.8.tar.gz","yanked":false,"yanked_reason":null}],"1.4.9":[{"comment_text":"","digests":{"blake2b_256":"916707ccfadce05da69ae6445bc40a941c916c25dbf27b066b777f93351164dd","md5":"b66a8a80ce0e64126731302f638a31c6","sha256":"3cb3e8531a435b6bb33001793b3fb51cf8d7e4a6f45e589a7ab3a8fee160a0d8"},"downloads":-1,"filename":"getdist-1.4.9.tar.gz","has_sig":false,"md5_digest":"b66a8a80ce0e64126731302f638a31c6","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826326,"upload_time":"2024-05-31T15:36:00","upload_time_iso_8601":"2024-05-31T15:36:00.315461Z","url":"https://files.pythonhosted.org/packages/91/67/07ccfadce05da69ae6445bc40a941c916c25dbf27b066b777f93351164dd/getdist-1.4.9.tar.gz","yanked":false,"yanked_reason":null}],"1.5.0":[{"comment_text":"","digests":{"blake2b_256":"d614ed0f832da72f4d270c3e324dc8739714d4585eec23d1dadb457b410dbc42","md5":"8f5f2c192fb577e4f5c711202766673b","sha256":"4ee0faf9c04369214be37443235d9bf02699265328b3c7590b6f954f600fb898"},"downloads":-1,"filename":"getdist-1.5.0.tar.gz","has_sig":false,"md5_digest":"8f5f2c192fb577e4f5c711202766673b","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826545,"upload_time":"2024-06-10T15:31:11","upload_time_iso_8601":"2024-06-10T15:31:11.249612Z","url":"https://files.pythonhosted.org/packages/d6/14/ed0f832da72f4d270c3e324dc8739714d4585eec23d1dadb457b410dbc42/getdist-1.5.0.tar.gz","yanked":false,"yanked_reason":null}],"1.5.1":[{"comment_text":"","digests":{"blake2b_256":"4d9ad7ae036ab03b535cee61e650f3c5def5db60916049321e09b6fe728d4874","md5":"f63434ab126ba5e48eca171f321bf93c","sha256":"857ec4773811504a92e543be706471dcc0b5e3a0c0beda8bec3d75e1db75d82f"},"downloads":-1,"filename":"getdist-1.5.1.tar.gz","has_sig":false,"md5_digest":"f63434ab126ba5e48eca171f321bf93c","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826571,"upload_time":"2024-06-17T13:59:47","upload_time_iso_8601":"2024-06-17T13:59:47.603363Z","url":"https://files.pythonhosted.org/packages/4d/9a/d7ae036ab03b535cee61e650f3c5def5db60916049321e09b6fe728d4874/getdist-1.5.1.tar.gz","yanked":false,"yanked_reason":null}]},"urls":[{"comment_text":"","digests":{"blake2b_256":"4d9ad7ae036ab03b535cee61e650f3c5def5db60916049321e09b6fe728d4874","md5":"f63434ab126ba5e48eca171f321bf93c","sha256":"857ec4773811504a92e543be706471dcc0b5e3a0c0beda8bec3d75e1db75d82f"},"downloads":-1,"filename":"getdist-1.5.1.tar.gz","has_sig":false,"md5_digest":"f63434ab126ba5e48eca171f321bf93c","packagetype":"sdist","python_version":"source","requires_python":">=3.7.0","size":826571,"upload_time":"2024-06-17T13:59:47","upload_time_iso_8601":"2024-06-17T13:59:47.603363Z","url":"https://files.pythonhosted.org/packages/4d/9a/d7ae036ab03b535cee61e650f3c5def5db60916049321e09b6fe728d4874/getdist-1.5.1.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}
