{"info":{"author":"Balazs Sandor","author_email":"sanyatuning@gmail.com","bugtrack_url":null,"classifiers":[],"description":"# zigpy-cc\n\n[![Build Status](https://travis-ci.org/zigpy/zigpy-cc.svg?branch=master)](https://travis-ci.org/zigpy/zigpy-cc)\n[![Coverage](https://coveralls.io/repos/github/zigpy/zigpy-cc/badge.svg?branch=master)](https://coveralls.io/github/zigpy/zigpy-cc?branch=master)\n\n[zigpy-cc](https://github.com/zigpy/zigpy-cc) is a Python 3 library implemention to add support for Texas Instruments CC series of [Zigbee](https://www.zigbee.org) radio module chips hardware to the [zigpy](https://github.com/zigpy/) project. Including but possibly not limited to Texas Instruments CC253x, CC26x2R, and CC13x2 chips flashed with a custom Z-Stack coordinator firmware.\n\nThe goal of this project is to add native support for inexpensive Texas Instruments CC chip based USB sticks in Home Assistant's built-in ZHA (Zigbee Home Automation) integration component (via the [zigpy](https://github.com/zigpy/) library), allowing Home Assistant with such hardware to nativly support direct control of compatible Zigbee devices such as Philips HUE, GE, Osram Lightify, Xiaomi/Aqara, IKEA Tradfri, Samsung SmartThings, and many more.\n\n- https://www.home-assistant.io/integrations/zha/\n\nzigpy-cc allows Zigpy to interact with Texas Instruments ZNP (Zigbee Network Processor) coordinator firmware via TI Z-Stack Monitor and Test(MT) APIs using an UART/serial interface.\n\nThe zigpy-cc library itself contain port code from the [zigbee-herdsman](https://github.com/Koenkk/zigbee-herdsman/tree/v0.12.24) project (version 0.12.24) for the [Zigbee2mqtt](https://www.zigbee2mqtt.io/) project by Koen Kanters (a.k.a. Koenkk GitHub). The zigbee-herdsman library itself in turn was originally a fork and rewrite of the [zigbee-shepherd](https://github.com/zigbeer/zigbee-shepherd) library by the [Zigbeer](https://github.com/zigbeer) project. Therefore, if code improvements or bug-fixes gets commited to the [zigbee-herdsman](https://github.com/Koenkk/zigbee-herdsman) library then it could, in theory, also be possible to port some or many of those code improvements to this zigpy-cc library for its benifit.\n\n## WARNING!!! - Work in progress\nDisclaimer: This software is provided \"AS IS\", without warranty of any kind. The zigpy-cc project is under development as WIP (work in progress), it is not fully working yet. \n\n# Hardware requirement\nThe zigpy-cc library is currently being tested by developers with Texas Instruments CC2531 and CC2652R based adapters/boards as as reference hardware but it should in theory be possible to get it working with work most USB-adapters and GPIO-modules based on Texas Instruments CC Zigbee radio module chips hardware. Note that unless you bought pre-flashed with correct custom firmware you will also have to flash the chip a compatible Z-Stack coordinator firmware before you can use the hardware, please read the firmware requirement section below.\n\n## Supported reference hardware being tested by zigpy-cc developers\n  - [CC2531 USB stick hardware flashed with custom Z-Stack 1.2 coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC2652R USB stick and dev board hardware flashed with custom Z-Stack 3.x coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n\n ## Supported hardware not activly tested by zigpy-cc developers\n  - [CC2530 + CC2591 USB sticks and dev board hardware flashed with custom Z-Stack 1.2 coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC2530 + CC2592 USB sticks and dev board hardware flashed with custom Z-Stack 1.2 coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC2538 + CC2592 dev board hardware flashed with custom Z-Stack 3.0 coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC1352P-2 USB sticks and dev board hardware flashed with custom Z-Stack 3.0 coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC2652P USB stick and dev board hardware flashed with custom Z-Stack 3.x coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n  - [CC2652RB USB stick and dev board hardware flashed with custom Z-Stack 3.x coordinator firmware from Zigbee2mqtt project](https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html)\n\n## Texas Instruments Chip Part Numbers\nTexas Instruments (TI) has quite a few different wireless MCU chips and they are all used/mentioned in open-source Zigbee world which can be daunting if you are just starting out. Here is a quick summary of part numbers and key features.\n\n### Older generation TI chips\n- CC2530 = 2.4GHz Zigbee and IEEE 802.15.4 wireless MCU. 8051 core, has very little RAM. Needs expensive compiler license for official TI stack.\n- CC2531 = CC2530 with built-in USB. Used in the cheap \"Zigbee sticks\" sold everywhere.\n- CC2538 = CC2538 2.4GHz Zigbee and IEEE 802.15.4 wireless MCU. CC253x with a more powerful ARM Cortex-M3 CPU core, up to 32KB of RAM, and and up to 512KB on-chip flash. This is the only chip in the CC253x series that Texas Instruments has officially released Zigbee 3.0 (Z-Stack 3.0.x) firmware, however only as an option as it is still not as powerful a the newer generation of TI chips listed bellow.\n\n### Newer generation TI chips\n\n#### 2.4GHz frequency only chips\n- CC2652R = 2.4GHz only wireless MCU for IEEE 802.15.4 multi-protocol (Zigbee, Bluetooth, Thread, IEEE 802.15.4g IPv6-enabled smart objects like 6LoWPAN, and proprietary systems). Cortex-M0 core for radio stack and Cortex-M4F core for application use, plenty of RAM. Free compiler option from TI.\n- CC2652RB = Pin compatible \"Crystal-less\" CC2652R, however not firmware compatible with CC2652R.\n- CC2652P = CC2652R with a built-in RF PA (Power Amplifier) for greatly improved range. Not pin or firmware compatible with CC2652R/CC2652RB. \n\n#### Multi frequency chips\n- CC1352R = Sub 1 GHz & 2.4 GHz wireless MCU. Essentially CC2652R with an extra sub-1GHz radio.\n- CC1352P = CC1352R with a built in RF PA (Power Amplifier) for greatly improved range.\n\n### Auxiliary TI chips\n- CC2591 and CC2592 = 2.4 GHz range extenders. These are not wireless MCUs, just auxillary PA (Power Amplifier) and LNA (Low Noise Amplifier) in the same package to improve RF (Radio Frequency) range of any 2.4 GHz radio chip.\n\n## Firmware requirement\nFirmware requirement is that they support Texas Instruments \"Z-Stack Monitor and Test\" APIs using an UART interface (serial communcation protocol), which they should do if they are flashed with custom Z-Stack \"coordinator\" for Zigbee Home Automation 1.2 (Z-Stack Home 1.2) or Zigbee 3.0 (Z-Stack 3.0.x or Z-Stack 3.x.0) firmware from the Zigbee2mqtt project.\n\n- https://github.com/Koenkk/Z-Stack-firmware/tree/master/coordinator\n\nThe necessary hardware and equipment for flashing firmware and the device preparation process is best described by the [Zigbee2mqtt](https://www.zigbee2mqtt.io/) project whos community maintain and distribute a custom pre-compiled Z-Stack coordinator firmware (.hex files) for their [Zigbee-Heardsman](https://github.com/Koenkk/zigbee-herdsman/) libary which also makes it compatible with the zigpy-cc library.\n\nCC253x based USB adapters, modules and dev boards in general does not come with a bootloader from the factory so needs to first be hardware flashed with a pre-compiled Z-Stack coordinator firmware (.hex file) via a Texas Instruments CC Debugger or a DIY GPIO debug adapter using the official \"SmartRF Flash-Programmer\" (v1.1x) software from Texas Instruments, or comparative alternative metods and software. These older less powerful chips are only designed for Zigbee Home Automation 1.2 (Z-Stack Home 1.2) firmware as they are not really powerfull enough to run the newer Zigbee 3.0 (Z-Stack 3.0.x) firmware. It should be mentioned that there it is technically possible to run inofficial Zigbee 3.0 (Z-Stack 3.0.x) firmware releases for CC253x, but such newer firmware are generally not recommended on these older adapters if you want to achieve a stable Zigbee network with more than a few paired devices.\n\nCC13x2/CC13x2x and CC26x2/CC26x2x based USB adapters, modules and dev boards in general already come with a bootloader from the factory so can be software flashed with a pre-compiled Z-Stack coordinator firmware (.hex file) directly over USB using the official \"SmartRF Flash-Programmer-2\" (v1.8+) or \"UniFlash\" (6.x) from Texas Instruments, or comparative alternative metods and software. These newer more powerful chips only support newer Zigbee 3.0 (Z-Stack 3.0.x or Z-Stack 3.x.0) firmware.\n\nThe [Zigbee2mqtt](https://www.zigbee2mqtt.io/) project has step-by-step intructions for both flashing with Texas Instruments official software as well as several alternative metods on how to initially flash their custom Z-Stack coordinator firmware on a new CC253x, CC13x2, CC26x2 and other Texas Instruments CCxxxx based USB adapters and development boards that comes or do not come with a bootloader. \n\n- https://www.zigbee2mqtt.io/information/supported_adapters.html\n- https://www.zigbee2mqtt.io/getting_started/what_do_i_need.html\n- https://www.zigbee2mqtt.io/getting_started/flashing_the_cc2531.html\n- https://www.zigbee2mqtt.io/information/alternative_flashing_methods.html\n\nNote that the [Zigbee2mqtt](https://www.zigbee2mqtt.io/) project also have a FAQ and knowledgebase that can be useful for working with these Texas Instruments ZNP coordinator hardware adapters/equipment for their Z-Stack as well as lists Zigbee devices which should be supported.\n\n## Port configuration\n\n- To configure __usb__ port path for your TI CC serial device, just specify the TTY (serial com) port, example : `/dev/ttyACM0`\n    - Alternatively you could try to set just port to `auto` to enable automatic usb port discovery (not garanteed to work).\n\nDevelopers should note that Texas Instruments recommends different baud rates for UART interface of different TI CC chips.\n- CC2530 and CC2531 default recommended UART baud rate is 115200 baud.\n- CC2538 also supports flexible UART baud rate generation but only up to a maximum of 460800 baud.\n- CC13x2 and CC26x2 support flexible UART baud rate generation up to a maximum of 1.5 Mbps.\n\n# Toubleshooting \n\nFor toubleshooting with Home Assistant, the general recommendation is to first only enable DEBUG logging for homeassistant.core and homeassistant.components.zha in Home Assistant, then look in the home-assistant.log file and try to get the Home Assistant community to exhausted their combined troubleshooting knowledge of the ZHA component before posting issue directly to a radio library like zigpy-cc.\n\nThat is, begin with checking debug logs for Home Assistant core and the ZHA component first, (troubleshooting/debugging from the top down instead of from the bottom up), trying to getting help via Home Assistant community forum before moving on to posting debug logs to zigpy and zigpy-cc. This is to general suggestion to help filter away common problems and not flood the zigpy-cc developer(s) with to many logs.\n\nPlease also try the very latest versions of zigpy and zigpy-cc, (see the section below about \"Testing new releases\"), and only if you still have the same issues with the latest versions then enable debug logging for zigpy and zigpy_cc in Home Assistant in addition to core and zha. Once enabled debug logging for all those libraries in Home Assistant you should try to reproduce the problem and then raise an issue in zigpy-cc repo with a copy of those logs.\n\nTo enable debugging in Home Assistant to get debug logs, either update logger configuration section in configuration.yaml or call logger.set_default_level service with {\"level\": \"debug\"} data. \n\nCheck logger component configuration where you want something in your Home Assistant configuration.yaml like this: \n  ```\n  logger:\n  default: info\n  logs:\n  asyncio: debug\n  homeassistant.core: debug\n  homeassistant.components.zha: debug\n  zigpy: debug\n  zigpy_cc: debug\n ```\n\n# Testing new releases\n\nTesting a new release of the zigpy-cc library before it is released in Home Assistant.\n\nIf you are using Supervised Home Assistant (formerly known as the Hassio/Hass.io distro):\n- Add https://github.com/home-assistant/hassio-addons-development as \"add-on\" repository\n- Install \"Custom deps deployment\" addon\n- Update config like: \n  ```\n  pypi:\n    - zigpy-cc==0.2.3\n  apk: []\n  ```\n  where 0.2.3 is the new version\n- Start the addon\n\nThis version will persist even so you update HA core.\nYou can remove custom deps with this config:\n  ```\n  pypi: []\n  apk: []\n  ```\n\nIf you are instead using some custom python installation of Home Assistant then do this:\n- Activate your python virtual env\n- Update package with ``pip``\n  ```\n  pip install zigpy-cc==0.2.3\n  ```\n\n# Releases via PyPI\n\nTagged versions will also be released via PyPI\n\n- https://pypi.org/project/zigpy-cc/\n    - https://pypi.org/project/zigpy-cc/#history\n    - https://pypi.org/project/zigpy-cc/#files\n\n# External documentation and reference\n\n- http://www.ti.com/tool/LAUNCHXL-CC26X2R1\n- http://www.ti.com/tool/LAUNCHXL-CC1352P\n\n# How to contribute\n\nIf you are looking to make a code or documentation contribution to this project we suggest that you follow the steps in these guides:\n- https://github.com/firstcontributions/first-contributions/blob/master/README.md\n- https://github.com/firstcontributions/first-contributions/blob/master/github-desktop-tutorial.md\n\n# Related projects\n\n### Zigpy\n**[zigpy](https://github.com/zigpy/zigpy)** is a [Zigbee protocol stack](https://en.wikipedia.org/wiki/Zigbee) integration project to implement the **[Zigbee Home Automation](https://www.zigbee.org/)** standard as a Python 3 library. Zigbee Home Automation integration with zigpy allows you to connect one of many off-the-shelf Zigbee adapters using one of the available Zigbee radio library modules compatible with zigpy to control Zigbee based devices. There is currently support for controlling Zigbee device types such as binary sensors (e.g., motion and door sensors), sensors (e.g., temperature sensors), lightbulbs, switches, and fans. A working implementation of zigbe exist in **[Home Assistant](https://www.home-assistant.io)** (Python based open source home automation software) as part of its **[ZHA component](https://www.home-assistant.io/components/zha/)**\n\n### ZHA Device Handlers\nZHA deviation handling in Home Assistant relies on on the third-party [ZHA Device Handlers](https://github.com/dmulcahey/zha-device-handlers) project. Zigbee devices that deviate from or do not fully conform to the standard specifications set by the [Zigbee Alliance](https://www.zigbee.org) may require the development of custom [ZHA Device Handlers](https://github.com/dmulcahey/zha-device-handlers) (ZHA custom quirks handler implementation) to for all their functions to work properly with the ZHA component in Home Assistant. These ZHA Device Handlers for Home Assistant can thus be used to parse custom messages to and from non-compliant Zigbee devices. The custom quirks implementations for zigpy implemented as ZHA Device Handlers for Home Assistant are a similar concept to that of [Zigbee-Herdsman Converters / Zigbee-Shepherd Converters as used by Zigbee2mqtt](https://www.zigbee2mqtt.io/how_tos/how_to_support_new_devices.html) as well as that of [Hub-connected Device Handlers for the SmartThings Classics platform](https://docs.smartthings.com/en/latest/device-type-developers-guide/), meaning they are each virtual representations of a physical device that expose additional functionality that is not provided out-of-the-box by the existing integration between these platforms.\n\n### ZHA Map\nHome Assistant can build ZHA network topology map using the [zha-map](https://github.com/zha-ng/zha-map) project.\n\n### zha-network-visualization-card\n[zha-network-visualization-card](https://github.com/dmulcahey/zha-network-visualization-card) is a custom Lovelace element for visualizing the ZHA Zigbee network in Home Assistant.\n\n### ZHA Network Card\n[zha-network-card](https://github.com/dmulcahey/zha-network-card) is a custom Lovelace card that displays ZHA network and device information in Home Assistant\n\n\n","description_content_type":"text/markdown","docs_url":null,"download_url":"","downloads":{"last_day":-1,"last_month":-1,"last_week":-1},"dynamic":null,"home_page":"http://github.com/zigpy/zigpy-cc","keywords":"","license":"GPL-3.0","maintainer":"","maintainer_email":"","name":"zigpy-cc","package_url":"https://pypi.org/project/zigpy-cc/","platform":"","project_url":"https://pypi.org/project/zigpy-cc/","project_urls":{"Homepage":"http://github.com/zigpy/zigpy-cc"},"provides_extra":null,"release_url":"https://pypi.org/project/zigpy-cc/0.5.2/","requires_dist":["pyserial-asyncio","zigpy (>=0.23.1)"],"requires_python":"","summary":"A library which communicates with Texas Instruments CC2531 radios for zigpy","version":"0.5.2","yanked":false,"yanked_reason":null},"last_serial":12283853,"releases":{"0.1.0":[{"comment_text":"","digests":{"blake2b_256":"ee4a32d09d7f275152e7a161b503a94367dd30c5f066f27a20a2be7f7b05820c","md5":"324f2b3764dda18de78fda261e863f69","sha256":"b48bc52b70449c53e6e453e638eb5db261ace8f5ae80125ebcc14e0c2d92331c"},"downloads":-1,"filename":"zigpy_cc-0.1.0-py3-none-any.whl","has_sig":false,"md5_digest":"324f2b3764dda18de78fda261e863f69","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26042,"upload_time":"2020-02-08T08:39:49","upload_time_iso_8601":"2020-02-08T08:39:49.515393Z","url":"https://files.pythonhosted.org/packages/ee/4a/32d09d7f275152e7a161b503a94367dd30c5f066f27a20a2be7f7b05820c/zigpy_cc-0.1.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"0507bb2afaf0746f4074ab12531932beb4f2d52abc2907da7cea8d3942126c1e","md5":"50260a197bf05c4a6bc2b6cbb314f3d8","sha256":"aa98ea64046fc466929b697cdc5a15136bc5dc94ee4a19432a4fc94f8e7ef1bf"},"downloads":-1,"filename":"zigpy-cc-0.1.0.tar.gz","has_sig":false,"md5_digest":"50260a197bf05c4a6bc2b6cbb314f3d8","packagetype":"sdist","python_version":"source","requires_python":null,"size":23637,"upload_time":"2020-02-08T08:39:52","upload_time_iso_8601":"2020-02-08T08:39:52.079976Z","url":"https://files.pythonhosted.org/packages/05/07/bb2afaf0746f4074ab12531932beb4f2d52abc2907da7cea8d3942126c1e/zigpy-cc-0.1.0.tar.gz","yanked":false,"yanked_reason":null}],"0.2.0":[{"comment_text":"","digests":{"blake2b_256":"328f5d9f726779051109929888f09617440e96b365abc95917dff74788d852ba","md5":"c985b3e7b7013f2893906d4f3ecd7587","sha256":"5aa65f9a514dd9064da17700a21313870fbd04467a0753ec22e1edb50385aa18"},"downloads":-1,"filename":"zigpy_cc-0.2.0-py3-none-any.whl","has_sig":false,"md5_digest":"c985b3e7b7013f2893906d4f3ecd7587","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26558,"upload_time":"2020-03-06T20:32:45","upload_time_iso_8601":"2020-03-06T20:32:45.855962Z","url":"https://files.pythonhosted.org/packages/32/8f/5d9f726779051109929888f09617440e96b365abc95917dff74788d852ba/zigpy_cc-0.2.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"91081333e6cda1c2e188867dc60dee3e3b0ef9f1059ad13f80b85fc27d1a6589","md5":"5ed36bc0e09899a94e2d0cf731a8a316","sha256":"4f58ebebf343a97ab8b51b6b21f5894597a74b4817cc8b7b8299cf9d090e0430"},"downloads":-1,"filename":"zigpy-cc-0.2.0.tar.gz","has_sig":false,"md5_digest":"5ed36bc0e09899a94e2d0cf731a8a316","packagetype":"sdist","python_version":"source","requires_python":null,"size":25948,"upload_time":"2020-03-06T20:32:46","upload_time_iso_8601":"2020-03-06T20:32:46.929097Z","url":"https://files.pythonhosted.org/packages/91/08/1333e6cda1c2e188867dc60dee3e3b0ef9f1059ad13f80b85fc27d1a6589/zigpy-cc-0.2.0.tar.gz","yanked":false,"yanked_reason":null}],"0.2.2":[{"comment_text":"","digests":{"blake2b_256":"b0341988dbf7d6f7e30b4c782353cfe3eaf5ff2d8e48636fe9b8be6aa563ca2b","md5":"2e49554cf32ab2c6197b3d069a5a5118","sha256":"a9f18f28a2ad1b1400e242182c490db6e99cb4a4b16d11153982d9f802528daf"},"downloads":-1,"filename":"zigpy_cc-0.2.2-py3-none-any.whl","has_sig":false,"md5_digest":"2e49554cf32ab2c6197b3d069a5a5118","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26615,"upload_time":"2020-03-06T21:53:39","upload_time_iso_8601":"2020-03-06T21:53:39.851912Z","url":"https://files.pythonhosted.org/packages/b0/34/1988dbf7d6f7e30b4c782353cfe3eaf5ff2d8e48636fe9b8be6aa563ca2b/zigpy_cc-0.2.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"60d0798e62d4879622c90aeec71c064b8e281c7ecacf77b8f47a5a2d39ca4d55","md5":"4e0951f8b3e2cc0920933e960d07e3f6","sha256":"7082b02208c976c8a906c30460448fb9bb794d52d4f55b17e73acafab507e065"},"downloads":-1,"filename":"zigpy-cc-0.2.2.tar.gz","has_sig":false,"md5_digest":"4e0951f8b3e2cc0920933e960d07e3f6","packagetype":"sdist","python_version":"source","requires_python":null,"size":25980,"upload_time":"2020-03-06T21:53:41","upload_time_iso_8601":"2020-03-06T21:53:41.062277Z","url":"https://files.pythonhosted.org/packages/60/d0/798e62d4879622c90aeec71c064b8e281c7ecacf77b8f47a5a2d39ca4d55/zigpy-cc-0.2.2.tar.gz","yanked":false,"yanked_reason":null}],"0.2.3":[{"comment_text":"","digests":{"blake2b_256":"ffd48d14062e83108a0ac3965fd3311fbf39baa37e5f5986dc3d1606248f5099","md5":"0a0738dc080343d56508e1b1d0908985","sha256":"f2a2f6d55d635d8e35c216a69bcfa11c8cac8ff7c7bc0d5827169f8d718bed2a"},"downloads":-1,"filename":"zigpy_cc-0.2.3-py3-none-any.whl","has_sig":false,"md5_digest":"0a0738dc080343d56508e1b1d0908985","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26685,"upload_time":"2020-03-14T15:20:39","upload_time_iso_8601":"2020-03-14T15:20:39.438116Z","url":"https://files.pythonhosted.org/packages/ff/d4/8d14062e83108a0ac3965fd3311fbf39baa37e5f5986dc3d1606248f5099/zigpy_cc-0.2.3-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"6eb34299cfa991cac25bcb23fbda0d94ba4d4a4ddb62fdfeed9a2d33f6c232ed","md5":"c034a497fa373956267051599716fa69","sha256":"eebe63386c30c4df11be2ae1fce072eef7f1a3843fdf6985064587ef4161c17a"},"downloads":-1,"filename":"zigpy-cc-0.2.3.tar.gz","has_sig":false,"md5_digest":"c034a497fa373956267051599716fa69","packagetype":"sdist","python_version":"source","requires_python":null,"size":26074,"upload_time":"2020-03-14T15:20:40","upload_time_iso_8601":"2020-03-14T15:20:40.611531Z","url":"https://files.pythonhosted.org/packages/6e/b3/4299cfa991cac25bcb23fbda0d94ba4d4a4ddb62fdfeed9a2d33f6c232ed/zigpy-cc-0.2.3.tar.gz","yanked":false,"yanked_reason":null}],"0.3.0":[{"comment_text":"","digests":{"blake2b_256":"ffeef07fe6c01ae39907d793fc8c04961545045595a6d3feed8c755a5bc20f88","md5":"701943fb2e7b06d7b12c0ba494ca0b17","sha256":"5a5366ad9058dd2d2acd7b54a285c30bd5345e51bf2c421a3169f3ae7d02d981"},"downloads":-1,"filename":"zigpy_cc-0.3.0-py3-none-any.whl","has_sig":false,"md5_digest":"701943fb2e7b06d7b12c0ba494ca0b17","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26767,"upload_time":"2020-03-20T19:50:42","upload_time_iso_8601":"2020-03-20T19:50:42.806976Z","url":"https://files.pythonhosted.org/packages/ff/ee/f07fe6c01ae39907d793fc8c04961545045595a6d3feed8c755a5bc20f88/zigpy_cc-0.3.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"045e04ea76a183f82810fae35a92012ff6c683f6c882d3bd56c4d4e64b282f7d","md5":"3d0fb16b636847e0099cb5cd965575a1","sha256":"f8dc41efe2a4f0ed11519008cc5f81e77ea84ec74d23aff4ba133e413884ec1c"},"downloads":-1,"filename":"zigpy-cc-0.3.0.tar.gz","has_sig":false,"md5_digest":"3d0fb16b636847e0099cb5cd965575a1","packagetype":"sdist","python_version":"source","requires_python":null,"size":26366,"upload_time":"2020-03-20T19:50:43","upload_time_iso_8601":"2020-03-20T19:50:43.954190Z","url":"https://files.pythonhosted.org/packages/04/5e/04ea76a183f82810fae35a92012ff6c683f6c882d3bd56c4d4e64b282f7d/zigpy-cc-0.3.0.tar.gz","yanked":false,"yanked_reason":null}],"0.3.1":[{"comment_text":"","digests":{"blake2b_256":"d908cf876d057dea64ae4b7b33984c9862c680ea302d5d5c7d9c9acbc2a8aa25","md5":"cf38b81a8a8f4658f08ffdc03d58c61f","sha256":"60f6e1b9b561f2fa28f988f472b2753b63bec78668cb56d8e361ef57dc0ddfdf"},"downloads":-1,"filename":"zigpy_cc-0.3.1-py3-none-any.whl","has_sig":false,"md5_digest":"cf38b81a8a8f4658f08ffdc03d58c61f","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":26950,"upload_time":"2020-03-30T05:14:54","upload_time_iso_8601":"2020-03-30T05:14:54.711936Z","url":"https://files.pythonhosted.org/packages/d9/08/cf876d057dea64ae4b7b33984c9862c680ea302d5d5c7d9c9acbc2a8aa25/zigpy_cc-0.3.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"8b1d953b0a56a25bff1f3d40e09e54883784ded6accb0f0fd30e8c8163eb9704","md5":"82337d5fcd04299159478da916773dbf","sha256":"91413468ca053bbca674de1206cb8495598fddcedada633cf1fddbd743ace58e"},"downloads":-1,"filename":"zigpy-cc-0.3.1.tar.gz","has_sig":false,"md5_digest":"82337d5fcd04299159478da916773dbf","packagetype":"sdist","python_version":"source","requires_python":null,"size":26514,"upload_time":"2020-03-30T05:14:55","upload_time_iso_8601":"2020-03-30T05:14:55.568642Z","url":"https://files.pythonhosted.org/packages/8b/1d/953b0a56a25bff1f3d40e09e54883784ded6accb0f0fd30e8c8163eb9704/zigpy-cc-0.3.1.tar.gz","yanked":false,"yanked_reason":null}],"0.3.2":[{"comment_text":"","digests":{"blake2b_256":"8c00fcb23506067047683fa366d22157d2aa02ca7350d58ed604ed94ece41574","md5":"11b026d1b061c747c084059db5b6c037","sha256":"c548b1f509b9c7307061d1dead791ba716c9d72786ef62ba0b896cdf3b998e65"},"downloads":-1,"filename":"zigpy_cc-0.3.2-py3-none-any.whl","has_sig":false,"md5_digest":"11b026d1b061c747c084059db5b6c037","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":27839,"upload_time":"2020-05-03T21:20:35","upload_time_iso_8601":"2020-05-03T21:20:35.538353Z","url":"https://files.pythonhosted.org/packages/8c/00/fcb23506067047683fa366d22157d2aa02ca7350d58ed604ed94ece41574/zigpy_cc-0.3.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"bfcdfd1130cd04df64b78292af80fbe121f3f51111dd4f4ce2a5120dd10565a4","md5":"7df875c87eaaf3872d0c95e33a7a6f19","sha256":"22f81696b56d89e7cacd1cbe791bbf93c03d75ec85e67573d5bddc8dd0ebb975"},"downloads":-1,"filename":"zigpy-cc-0.3.2.tar.gz","has_sig":false,"md5_digest":"7df875c87eaaf3872d0c95e33a7a6f19","packagetype":"sdist","python_version":"source","requires_python":null,"size":27376,"upload_time":"2020-05-03T21:20:36","upload_time_iso_8601":"2020-05-03T21:20:36.642345Z","url":"https://files.pythonhosted.org/packages/bf/cd/fd1130cd04df64b78292af80fbe121f3f51111dd4f4ce2a5120dd10565a4/zigpy-cc-0.3.2.tar.gz","yanked":false,"yanked_reason":null}],"0.4.0":[{"comment_text":"","digests":{"blake2b_256":"5a6bc9c18461770e0f5f9d65039f6280b4fdf830a9681464673983f6409ad877","md5":"af81c2e616d54ea6cb0cdb0778464581","sha256":"966ce67083cc75db246399be7cf81835ce1077a24647267da7c626ec6d4f553f"},"downloads":-1,"filename":"zigpy_cc-0.4.0-py3-none-any.whl","has_sig":false,"md5_digest":"af81c2e616d54ea6cb0cdb0778464581","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":43681,"upload_time":"2020-04-16T00:33:51","upload_time_iso_8601":"2020-04-16T00:33:51.615348Z","url":"https://files.pythonhosted.org/packages/5a/6b/c9c18461770e0f5f9d65039f6280b4fdf830a9681464673983f6409ad877/zigpy_cc-0.4.0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"8cdd05e3b595aaf9a78887d20f00629610b937a2842e60b8de1e2b60cf39141f","md5":"9203e7600caeba4fc6310ae285c3357e","sha256":"94b77665a99af2a086b286802144124ada98c975d3d248f2574dc426b95e75c9"},"downloads":-1,"filename":"zigpy-cc-0.4.0.tar.gz","has_sig":false,"md5_digest":"9203e7600caeba4fc6310ae285c3357e","packagetype":"sdist","python_version":"source","requires_python":null,"size":31242,"upload_time":"2020-04-16T00:33:52","upload_time_iso_8601":"2020-04-16T00:33:52.506351Z","url":"https://files.pythonhosted.org/packages/8c/dd/05e3b595aaf9a78887d20f00629610b937a2842e60b8de1e2b60cf39141f/zigpy-cc-0.4.0.tar.gz","yanked":false,"yanked_reason":null}],"0.4.1":[{"comment_text":"","digests":{"blake2b_256":"3f068452e777450451a2085425d24e505ca47cebdaba3d5938b55c1071d552fd","md5":"00ddeb2b4e398778ebd0ddab262f3c93","sha256":"297913ebf49513f9a0af23eba39b2a4bbc10a9f09be82add3ab38a8a988ee8f2"},"downloads":-1,"filename":"zigpy_cc-0.4.1-py3-none-any.whl","has_sig":false,"md5_digest":"00ddeb2b4e398778ebd0ddab262f3c93","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":43740,"upload_time":"2020-05-03T02:54:59","upload_time_iso_8601":"2020-05-03T02:54:59.793490Z","url":"https://files.pythonhosted.org/packages/3f/06/8452e777450451a2085425d24e505ca47cebdaba3d5938b55c1071d552fd/zigpy_cc-0.4.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"58ef5a65c79760ddcb7f7200abf2b35e79cd7a74834c3a9583a822e21431c023","md5":"654a336e2e8378b3a79bfb83fbd68a24","sha256":"4b3b4a79e90a9b0c19c95546683041b85edac7ff355a5f7a8d7821983333a0bb"},"downloads":-1,"filename":"zigpy-cc-0.4.1.tar.gz","has_sig":false,"md5_digest":"654a336e2e8378b3a79bfb83fbd68a24","packagetype":"sdist","python_version":"source","requires_python":null,"size":31348,"upload_time":"2020-05-03T02:55:00","upload_time_iso_8601":"2020-05-03T02:55:00.918486Z","url":"https://files.pythonhosted.org/packages/58/ef/5a65c79760ddcb7f7200abf2b35e79cd7a74834c3a9583a822e21431c023/zigpy-cc-0.4.1.tar.gz","yanked":false,"yanked_reason":null}],"0.4.2":[{"comment_text":"","digests":{"blake2b_256":"5ba5420b4b98f9fba81388f3469448ef510f656f398406fc37c3639d367746df","md5":"9605700b419b535bf4302ee4d426a73e","sha256":"f7d3ae27a6c27d469ffe9591d0155210edb80d20825c1fd4038b323daea35632"},"downloads":-1,"filename":"zigpy_cc-0.4.2-py3-none-any.whl","has_sig":false,"md5_digest":"9605700b419b535bf4302ee4d426a73e","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":44622,"upload_time":"2020-05-03T21:23:11","upload_time_iso_8601":"2020-05-03T21:23:11.132435Z","url":"https://files.pythonhosted.org/packages/5b/a5/420b4b98f9fba81388f3469448ef510f656f398406fc37c3639d367746df/zigpy_cc-0.4.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"5f0349ac7a6b5f9b4467d5faaa87678ed3a6524f55c4bf3867674ac5c6dc27a8","md5":"9868acaed9e62299618ecbf3250663b3","sha256":"0edf5ac280a1356c1eb329b1d736165f307dde296532ad3db4901b31d5cc8f20"},"downloads":-1,"filename":"zigpy-cc-0.4.2.tar.gz","has_sig":false,"md5_digest":"9868acaed9e62299618ecbf3250663b3","packagetype":"sdist","python_version":"source","requires_python":null,"size":32223,"upload_time":"2020-05-03T21:23:12","upload_time_iso_8601":"2020-05-03T21:23:12.300938Z","url":"https://files.pythonhosted.org/packages/5f/03/49ac7a6b5f9b4467d5faaa87678ed3a6524f55c4bf3867674ac5c6dc27a8/zigpy-cc-0.4.2.tar.gz","yanked":false,"yanked_reason":null}],"0.4.4":[{"comment_text":"","digests":{"blake2b_256":"68ac2e94005a50eda8ecbec1eb242a36512428da346cdecbbfef7be8d4f70edd","md5":"5d42ea5281877f85ff1ee97687795c75","sha256":"f804d2863063d79b110265a39f531c7d14a055d569444eb8d0db3738a690ebba"},"downloads":-1,"filename":"zigpy_cc-0.4.4-py3-none-any.whl","has_sig":false,"md5_digest":"5d42ea5281877f85ff1ee97687795c75","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":45832,"upload_time":"2020-05-21T15:57:27","upload_time_iso_8601":"2020-05-21T15:57:27.344488Z","url":"https://files.pythonhosted.org/packages/68/ac/2e94005a50eda8ecbec1eb242a36512428da346cdecbbfef7be8d4f70edd/zigpy_cc-0.4.4-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"78f9eaa0d7a28aa4528ed5ce56b7f99ca908566260a4b847eb2cbeb0b7bd4f28","md5":"373d09bac43afe1fb07fdf6d6824f11d","sha256":"d4be37d6615460dffc1b8e077af5df4cc3434dfbfbe5349d9eb67832554fea84"},"downloads":-1,"filename":"zigpy-cc-0.4.4.tar.gz","has_sig":false,"md5_digest":"373d09bac43afe1fb07fdf6d6824f11d","packagetype":"sdist","python_version":"source","requires_python":null,"size":34580,"upload_time":"2020-05-21T15:57:28","upload_time_iso_8601":"2020-05-21T15:57:28.979648Z","url":"https://files.pythonhosted.org/packages/78/f9/eaa0d7a28aa4528ed5ce56b7f99ca908566260a4b847eb2cbeb0b7bd4f28/zigpy-cc-0.4.4.tar.gz","yanked":false,"yanked_reason":null}],"0.5.0b0":[{"comment_text":"","digests":{"blake2b_256":"2e995466880d18eef55d0eef9902cbd1f2646931ad16909e5150b0aa89be420b","md5":"5b9dd77057e00f5495e83d25b3a15d9f","sha256":"eb24a9c20ab5f9188baa62ac1376d3f5535708b2fb54c56aa5a7f1db8bfd7a9f"},"downloads":-1,"filename":"zigpy_cc-0.5.0b0-py3-none-any.whl","has_sig":false,"md5_digest":"5b9dd77057e00f5495e83d25b3a15d9f","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":47195,"upload_time":"2020-07-19T16:58:07","upload_time_iso_8601":"2020-07-19T16:58:07.658216Z","url":"https://files.pythonhosted.org/packages/2e/99/5466880d18eef55d0eef9902cbd1f2646931ad16909e5150b0aa89be420b/zigpy_cc-0.5.0b0-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"fbc372dee0d276a1b3f6b2dfd7248c5d51d385659e86d800cfaba2c3f8fa1711","md5":"049c76db113341a0598f6cca66247972","sha256":"13b396fffe7afaa041f52f2a3ac9e0e64343e1704dba87c95d707f4ba7df2509"},"downloads":-1,"filename":"zigpy-cc-0.5.0b0.tar.gz","has_sig":false,"md5_digest":"049c76db113341a0598f6cca66247972","packagetype":"sdist","python_version":"source","requires_python":null,"size":36831,"upload_time":"2020-07-19T16:58:08","upload_time_iso_8601":"2020-07-19T16:58:08.663022Z","url":"https://files.pythonhosted.org/packages/fb/c3/72dee0d276a1b3f6b2dfd7248c5d51d385659e86d800cfaba2c3f8fa1711/zigpy-cc-0.5.0b0.tar.gz","yanked":false,"yanked_reason":null}],"0.5.1":[{"comment_text":"","digests":{"blake2b_256":"e8f881b570a30ff9a7d0db043bbac96edf1e5747fe761d2c04699df94faa6355","md5":"4fb905b70aca700a112753e35958893b","sha256":"87372b10d3c416ec5be8639083006258a527d7e29ed5c8ffe48039b1887d2116"},"downloads":-1,"filename":"zigpy_cc-0.5.1-py3-none-any.whl","has_sig":false,"md5_digest":"4fb905b70aca700a112753e35958893b","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":47144,"upload_time":"2020-08-13T18:57:07","upload_time_iso_8601":"2020-08-13T18:57:07.754565Z","url":"https://files.pythonhosted.org/packages/e8/f8/81b570a30ff9a7d0db043bbac96edf1e5747fe761d2c04699df94faa6355/zigpy_cc-0.5.1-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"efe07d70afa9ab9e3c8e988ddd510d76bd83d92481463f81ce5f15773dbd3238","md5":"8435a2f0eeb67e23ee9d160cbf663622","sha256":"06759615b28c45beaa5f03e594769a373d41674b96aeafefccd5c4e1c67e25ca"},"downloads":-1,"filename":"zigpy-cc-0.5.1.tar.gz","has_sig":false,"md5_digest":"8435a2f0eeb67e23ee9d160cbf663622","packagetype":"sdist","python_version":"source","requires_python":null,"size":36766,"upload_time":"2020-08-13T18:57:08","upload_time_iso_8601":"2020-08-13T18:57:08.905730Z","url":"https://files.pythonhosted.org/packages/ef/e0/7d70afa9ab9e3c8e988ddd510d76bd83d92481463f81ce5f15773dbd3238/zigpy-cc-0.5.1.tar.gz","yanked":false,"yanked_reason":null}],"0.5.2":[{"comment_text":"","digests":{"blake2b_256":"5e5aacd7aa9617e02af8178d54151e384b5f75dd2c56c8ba4c139f1d65d3b033","md5":"df7d191ea631078f31d5d935d61eec92","sha256":"31f1323c868ec4606e3c55c44fd6b0181f45219a4d9c09d0002cea3a7364e47c"},"downloads":-1,"filename":"zigpy_cc-0.5.2-py3-none-any.whl","has_sig":false,"md5_digest":"df7d191ea631078f31d5d935d61eec92","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":47427,"upload_time":"2020-09-05T18:47:10","upload_time_iso_8601":"2020-09-05T18:47:10.967273Z","url":"https://files.pythonhosted.org/packages/5e/5a/acd7aa9617e02af8178d54151e384b5f75dd2c56c8ba4c139f1d65d3b033/zigpy_cc-0.5.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"65a96fe8c3ed38b5eb1a40b8d76715ef44e239d90e3753db954a08565a4a7b6e","md5":"702f0bd3b0e1b796f979410735eb20fd","sha256":"832160c16d665ace4b961da2c9c55d2f6baa78cf9d5ee2a4c2e6743a1e85923f"},"downloads":-1,"filename":"zigpy-cc-0.5.2.tar.gz","has_sig":false,"md5_digest":"702f0bd3b0e1b796f979410735eb20fd","packagetype":"sdist","python_version":"source","requires_python":null,"size":37409,"upload_time":"2020-09-05T18:47:11","upload_time_iso_8601":"2020-09-05T18:47:11.928421Z","url":"https://files.pythonhosted.org/packages/65/a9/6fe8c3ed38b5eb1a40b8d76715ef44e239d90e3753db954a08565a4a7b6e/zigpy-cc-0.5.2.tar.gz","yanked":false,"yanked_reason":null}]},"urls":[{"comment_text":"","digests":{"blake2b_256":"5e5aacd7aa9617e02af8178d54151e384b5f75dd2c56c8ba4c139f1d65d3b033","md5":"df7d191ea631078f31d5d935d61eec92","sha256":"31f1323c868ec4606e3c55c44fd6b0181f45219a4d9c09d0002cea3a7364e47c"},"downloads":-1,"filename":"zigpy_cc-0.5.2-py3-none-any.whl","has_sig":false,"md5_digest":"df7d191ea631078f31d5d935d61eec92","packagetype":"bdist_wheel","python_version":"py3","requires_python":null,"size":47427,"upload_time":"2020-09-05T18:47:10","upload_time_iso_8601":"2020-09-05T18:47:10.967273Z","url":"https://files.pythonhosted.org/packages/5e/5a/acd7aa9617e02af8178d54151e384b5f75dd2c56c8ba4c139f1d65d3b033/zigpy_cc-0.5.2-py3-none-any.whl","yanked":false,"yanked_reason":null},{"comment_text":"","digests":{"blake2b_256":"65a96fe8c3ed38b5eb1a40b8d76715ef44e239d90e3753db954a08565a4a7b6e","md5":"702f0bd3b0e1b796f979410735eb20fd","sha256":"832160c16d665ace4b961da2c9c55d2f6baa78cf9d5ee2a4c2e6743a1e85923f"},"downloads":-1,"filename":"zigpy-cc-0.5.2.tar.gz","has_sig":false,"md5_digest":"702f0bd3b0e1b796f979410735eb20fd","packagetype":"sdist","python_version":"source","requires_python":null,"size":37409,"upload_time":"2020-09-05T18:47:11","upload_time_iso_8601":"2020-09-05T18:47:11.928421Z","url":"https://files.pythonhosted.org/packages/65/a9/6fe8c3ed38b5eb1a40b8d76715ef44e239d90e3753db954a08565a4a7b6e/zigpy-cc-0.5.2.tar.gz","yanked":false,"yanked_reason":null}],"vulnerabilities":[]}
